[{"jg6iir": ["Wi-Fi enable speakers that would let me play music to one or all speakers at the same time?\nIs it possible with any brand of Wi-Fi enabled speakers to play music to multiple (or at least all) my speakers? I'm moving into a much larger space and I'd like to have a setup with wireless speakers around the house that I can just start streaming music to at individual speaker at any time, but I also want to option if I have a lot of guests over to play the same music source to all of the speakers.", "https://www.reddit.com/r/smarthome/comments/jg6iir/wifi_enable_speakers_that_would_let_me_play_music/", 1, 22, "smarthome", "privacy", {"g9okq8o": ["Sonos or homepods. Everything else sounds awful. \n\nSource have both.", 4, "t3_jg6iir"], "g9pahf1": ["Thanks for all the input! I'm looking forward to getting this all setup, it sounds like exactly what I wanted.", 2, "t1_g9p1v51"], "g9okocr": ["Sound like crap and tell google your inside leg measurement though.", 2, "t1_g9oh76f"], "g9p21dt": ["Per other comments...get Sonos. It's expensive, but its light years better than the rest of the setups AND has the most flexibility of use cases and features (e.g. home theater setups, ways to hook up a turntable, etc) that are missing from most of the other mentioned wireless audio systems.", 2, "t3_jg6iir"], "g9oullk": ["I was thinking Sonos, I've seen it somewhat at some customer locations but I never played with it much. Can I control the devices through a Sonos app to tell it which speakers to play through, or would it be similar to what I have now where I open Spotify and pick a device on the same network to cast to?", 2, "t1_g9okq8o"], "g9pa3eu": ["[deleted]", 1, "t3_jg6iir"], "g9pic60": ["Nest devices let you sync the music whenever you put them in the room and work over wifi by adding themselves a delay between each other", 1, "t3_jg6iir"], "g9p1v51": ["You can do both. Sonos has its own app, which can control the speakers individually or as groups/rooms/etc. It also aggregates multiple music services through the app, so you can use them directly in the app itself.\n\nWhether you can stream directly from the music apps themself will be determined by what type of device you're using—new Sonos speakers work with AirPlay and can thus stream virtually any audio source from an iOS device, but Sonos doesn't work with   \n\"Casting\". Good news for you though is that I \\*think\\* Spotify works with Sonos natively from the Spotify app and wouldn't matter whether you were on iOS or Android.", 1, "t1_g9oullk"], "g9ryruj": ["Not owning an apple device is the deal breaker, understood.  No, airplay is not required that i am aware of.", 1, "t1_g9ryfmt"], "g9rfg1t": ["What’s the argument against HomePod Mini?  Seems like the obvious choice.  What am I missing?", 1, "t3_jg6iir"], "g9qcjgw": ["I use Apple Airport Expresses in different rooms. AirPlay2 then allows me to stream to any or all rooms. I plug speakers into each AirPort express. It's awesome and it's cheaper than Sonos. You can find them on eBay pretty reasonably.", 1, "t3_jg6iir"], "g9qj95c": ["if you add some ikea speakers with it its not that expensive anymore.", 1, "t1_g9p21dt"], "g9ryfmt": ["I don't own any Apple devices whatsoever and as far as I'm aware the Homepod requires AirPlay. Plus Sonos seems to have a pretty decent API that I could try and use to do app development in the future (I just want a QR Code people can scan that will take them to a webpage where they can queue up songs from Spotify.)", 1, "t1_g9rfg1t"], "g9qidqc": ["Spotify is 100% native on Sonos of you want it to be. The sound is great. Only reason I’m changing to 100% homepods is simplicity and privacy (getting rid of Alexa units I had that voice controlled the Sonos units)", 1, "t1_g9pahf1"], "g9ojryb": ["Google home devices\nOr Sonos also", 1, "t3_jg6iir"], "g9omjcd": ["Used chromecast audios off of eBay.", 1, "t3_jg6iir"], "g9qecyv": ["I use Bose and Homepods to do this. I have 2 Bose Soundbars and a Bose Portable and 2 HomePods pairs. If you get something with Airplay2, it is definitely possible.", 1, "t3_jg6iir"], "g9ra72z": ["I'm trying out some JBL in-ceiling hooked to either hifi-berry or falling back to Amazon devices.\n\nHifi-berry is an amp hat that sits on a raspberry-pi and you can find tons of projects to add a small breakout display. The only 'issue' I see is that it uses pulse audio to do the audio routing and the app support is lower. I would want to route Spotify to it. \n\nAmazon devices (echo dot) have a neat liitle 3d printed in-wall holder for the dot (no no display support).", 1, "t3_jg6iir"], "g9ogzgr": ["Amazon Echo speakers or Apple Homepod speakers will do that.", 0, "t3_jg6iir"], "g9oh76f": ["there are some very expensive options for whole house sound distribution, i was going to go down that path until i realized its better to put google homes everywhere. they can be part of multiple groups, guests can play music, and you can move music around using your voice.", 0, "t3_jg6iir"], "g9pwh1b": ["I use amazon echo dots. I do this because although they don’t sound absolutely horrible on their own, they also have an aux port, so in any room where I really care about the sound (bedroom, living room) I plug those bad boys into something better. They support multi room music and Spotify connect.", 0, "t3_jg6iir"], "g9oh791": ["I use echo dots and soundbars (Vizio), a sound bar sounds much better than a speaker.  I have them hidden in multiple areas upper shelves, on top of fridge,etc.  There’s an all in one bar that works great mounted upside down on my entry.  You’d never know it was there.", 0, "t3_jg6iir"]}], "jeotrs": ["Which security cameras to get?\nI want to add security cameras to my property in several strategic areas but I'm not sure what I want. I don't like the monthly subscription fees, and also not sure if I want battery or wired units. We have Google assistants around the house too,  so I would like it to be compatible with those. Also which doorbell camera? Please let me know your experiences.", "https://www.reddit.com/r/smarthome/comments/jeotrs/which_security_cameras_to_get/", 1, 5, "smarthome", "privacy", {"g9fmx7n": ["I like your questions as I was not very specific with those I guess. I want general home security.  Something that can get a persons face if my car is parked right outside the garage. Storage I am not sure of, thats why I don't know about monthly fees or is there a way I can store on site. I don't want to be able to see on my phone with a slight delay.", 1, "t1_g9fm8f7"], "g9fm8f7": ["It really depends on what you expect and how much you are willing to spend. Want to read license plates on passing cars 300’ away at night?  It will cost you hundreds of dollars per camera. Do you value the integration and remote access more than video quality?  Need to store continuous video for insurance or security audits?", 1, "t3_jeotrs"], "g9g50y8": ["Do you care about privacy? no? Eufy. Yes? Eve.", 1, "t3_jeotrs"], "g9ffahs": ["I am very new to this but as far as set up goes the Google nest cameras are dead easy. I set two of them up last night, one regular outdoor camera and one IQ camera. I’ve got someone coming to install them today. If you buy the subscription for a year you get two months free. I’m doing this primarily because the storage for my business is in my garage So I’m going to run the cameras through my business account.  I went with the Google cameras because even though I’m an Apple person I decided to forgo HomeKit and all of the issues I had read about and go for a Google mesh network + google home devices.  All of my devices are set up on the guest network so that I don’t have to worry so much about them sending my information home to China.  All they can get right now is how many times I open and close my garage door every day LOL", 1, "t3_jeotrs"], "g9hj5m6": ["arlo is probably the best plug and play option ultras if you can afford em, and they have a doorbell and a siren. Your going to have subscription fees even if you do poe  cameras( I recommend hikvision 8mp units) even if you  do some free person recognition option  off github because you will need offsite video  storage,  and you can setup up a google drive to do this.", 1, "t3_jeotrs"], "g9gi5gj": ["If you are willing to tinker, motioneye is a good free tool to handle almost any usb cameras. It can save files locally and to various cloud services for free too.", 1, "t3_jeotrs"]}], "jfhnnp": ["Personal Cloud from home with Nextcloud and Raspberry Pi\nIn this video we will install Nextcloud on a Raspberry Pi 4 so we can upload our files from mobile and desktop devices just like Google Drive, OneDrive, Dropbox and others, but directly to our homes with a lot more privacy. \n\nIn a times where pretty much every big company tracks you down from everywhere and it is almost impossible to escape them if you are using Internet. Nextcloud and a local computer is kind of fresh air of personal privacy.  \n\nWait a minute here, you may ask what is Nextcloud? \n\nNextcloud is an open-source project that you can install on your local device. It allows you to control and upload \n\ndocuments, pictures, and everything you wish on your own personal computer at home. And not on the Google, Microsoft or Amazon cloud.\n\nTo successfully implement this you will need: \n\nA Raspberry Pi (where Raspberry Pi 4 is recommended) with installed RaspberryOS and secure shell access to it.\n\n* You will also need a public static IP contact your internet service provider for that\n* Of course You will need some kind of storage the more the better. If you want to store your pictures and videos you will need a lot, but if you want to save only important documents several gigabytes will be enough.\n\nFor the demo I will use a SD card for the RaspberryOS and a USB flash drive for the Nextcloud storage. It is recommended to use SSD drives if you have some around. \n\nNow let's install Nextcloud on a Raspberry pi to see what will happen:\n\nThe Video 🔴 🎥 [https://youtu.be/YENbrYUd9SA](https://youtu.be/YENbrYUd9SA)\n\n[Personal Cloud from home with Nextcloud and Raspberry Pi](https://preview.redd.it/tzrlyirrihu51.jpg?width=360&amp;format=pjpg&amp;auto=webp&amp;s=8fbb6adec86a063cb1bff51b4b66daf2933844fd)\n\nIf you prefer to read, this is the full Article ✍️📜 [https://peyanski.com/personal-cloud-from-home-nextcloud-on-raspberry-pi/](https://peyanski.com/personal-cloud-from-home-nextcloud-on-raspberry-pi/)\n\nAnd Web Story specially optimised for mobile devices (insta like) 📲 \n\n➡️ [https://peyanski.com/web-stories/install-nextcloud-on-raspberry-pi/](https://peyanski.com/web-stories/install-nextcloud-on-raspberry-pi/)\n\nCheers,\n\nKiril", "https://www.reddit.com/r/smarthome/comments/jfhnnp/personal_cloud_from_home_with_nextcloud_and/", 1, 0, "smarthome", "privacy", {}]},
{"jf8xn2": ["Timing my front porch shutter\nHi,\n\nThis is my first step in the smarthome world :-)\n\nI have an electric shutter that is now connected with a regular switch. I am looking for something wifi controlled to make an automatic timing of the opening and closure of the shutter. Any thoughts?", "https://www.reddit.com/r/smarthome/comments/jf8xn2/timing_my_front_porch_shutter/", 1, 2, "smarthome", "security", {"g9izuzx": ["Sonoff mini, fits in a regular switch box, works over wifi and best of all when you decide (and you WILL) to make more stuff smart it integrates with just about all the cool kid toys like home assistant making it much less of a network security risk!", 1, "t3_jf8xn2"], "g9mhga7": ["Thanks! It looks great. The challenge is that I have also a light that I want to control with the same switch", 1, "t1_g9izuzx"]}], "jgd3rq": ["Nest cameras?\nAre nest cameras worth it? Everything I got at home is Google powered, but maybe there are cheaper cameras tan the nest ones 🤔🤔 that integrate with Google Home", "https://www.reddit.com/r/smarthome/comments/jgd3rq/nest_cameras/", 1, 11, "smarthome", "security", {"g9q5tzi": ["Didn’t google just kill their home security products? Does that include the cameras? I’m not so happy with google and their product lifecycle right now.", 2, "t3_jgd3rq"], "g9qbdny": ["I've got their doorbell and 3 cameras. They're dummy easy to set up and the cloud storage app works great.\n\nDownside is that they're also expensive for what they offer, consume a lot of data, and there's no option for local storage of footage, so pulling large amounts of footage is nigh impossible.\n\nOverall, I'm happy with my purchase but would definitely consider other ecosystems if I wasn't already ~$800 invested into it.", 2, "t3_jgd3rq"], "g9quu8t": ["Hiya, have tried looking into local storage for example the Unifi Protect line? Might be something to consider when looking into a new system.", 1, "t3_jgd3rq"], "g9pq7rt": ["They’re on the pricy end but in my opinion they are the best cloud cams. I tried ring and dropcam before. The google nest plan is very fairly priced imo. My only knocks are Google’s history of dropping support for products and lack of HomeKit support. I solved the lack of HomeKit with home bridge and think nest is evolved enough for them not to drop. Some people complain nest system consumes too much data also; I have unlimited home data so it’s not an issue for me.", 1, "t3_jgd3rq"], "g9qhyb7": ["There are many security cameras that work with Google Home and are of the same quality level but cheaper than Nest cam. \n\nI think Ring Indoor can satisfy most of the needs for home monitoring. It cost around 50 bucks. If you don't need 24/7 recording and accept 12-second motion recording, you can  consider the 20 bucks Wyze Cam.\n\nWant AI detection but don't want to pay the subscription? Eufy indoor and SimCam 1S can tell the difference between people and pets, and provide activity zones without cloud processing.", 1, "t3_jgd3rq"], "g9qiph6": ["I have 8 Nest cameras in my house ranging from doorbells, indoor iq and outdoor iq.\n\nNest was one of the few manufacturers that had every product I wanted in a smart home. Makes it convenient to have all of it under one app", 1, "t3_jgd3rq"], "g9qutx5": ["They are not the best cameras, by quite some margin. You pay for the convenience. And not just now. You pay for said convienience month after month after month for as long as you own the device(s).\n\nThat is obviously only if you want to watch what the cameras that you paid for recorded. If you're fine logging in every now and again to view what's going on at that moment, that's free.\n\nAt least the cameras themselves are pretty afforda... holy fuck $199 for a basic indoor 1080p camera.\n\nNo, unless you don't care for money I can't in good conscious recommend it to anyone.", 1, "t3_jgd3rq"], "g9q6wn4": ["No, cameras were not part of the security hub.   But yeah, I wouldn't feel confident with investing in them.", 1, "t1_g9q5tzi"], "g9qou9z": ["Key word is had. I’m still pretty pissed about google dropping Nest Secure.", 1, "t1_g9qiph6"], "g9qru4d": ["Here's a review of somother cams\nhttps://youtu.be/nBnBBS3N1xI", 1, "t3_jgd3rq"], "g9uar0j": ["Nest cams are the only ones that truly integrate with GH. Others, like Wyze, can be accessed by the Google Assistant but cannot be accessed or viewed in the GH app.", 1, "t1_g9qhyb7"]}], "jf2jfp": ["Smart locks\nI am super new to this, but have a smart lock question. If I want to control everything with my many Echos, is there a safety issue with locks? We have one echo in our living room. You could shout through the window next to the front door “Alexa unlock the door.”  Is there a code that would need to be given or is this a true security concern?", "https://www.reddit.com/r/smarthome/comments/jf2jfp/smart_locks/", 1, 5, "smarthome", "security", {"g9m2pcr": ["You can unlock a smartlock in HomeKit by voice with your watch or phone if either is unlocked.", 1, "t3_jf2jfp"], "g9jq68p": ["Thank you!", 1, "t1_g9jl1io"], "g9htj4h": ["I have an August smart lock integrated with Alexa and have to provide a code for the unlock to be initiated. Sure it may be a security concern if the code is known and your window is left open for someone to yell in, but the same could be said about something like a garage door code. Just be careful with it and you should be fine.", 1, "t3_jf2jfp"], "g9huy28": ["Okay I just wanted to be sure there’s a code. I don’t expect anyone to over hear it", 1, "t1_g9htj4h"], "g9jl1io": ["Some locks can not be opened by voice and some require a pin to do so. This used to he a concern, but I believe every major brand has addressed this issue.", 1, "t3_jf2jfp"]}], "jg4ay3": ["Smart Home Poll\nWould you rather Amazon Alexa or Google Assistant", "https://www.reddit.com/r/smarthome/comments/jg4ay3/smart_home_poll/", 1, 16, "smarthome", "security", {"g9p68lm": ["Strange poll, without a poll. \n\nAlexa, but only because I set \"her\" up first with my home automation and I'm too lazy to switch over (I run both).", 4, "t3_jg4ay3"], "g9ondww": ["google", 2, "t3_jg4ay3"], "g9p3msx": ["Alexa", 2, "t3_jg4ay3"], "g9o4cxu": ["Alexa", 1, "t3_jg4ay3"], "g9o3tvi": ["Alexa", 1, "t3_jg4ay3"], "g9ohp6e": ["Alexa", 1, "t3_jg4ay3"], "g9pejl2": ["Siri", 1, "t3_jg4ay3"], "g9pd0ko": ["Alexa", 1, "t3_jg4ay3"], "g9pk5of": ["Google", 1, "t3_jg4ay3"], "g9o5tto": ["Alexa", 1, "t3_jg4ay3"], "g9ot64w": ["They both do similar things, and I have not compared them by feature or what devices they work well with. I think that would be where I would start though, going through the lists of what works with Alexa VS Google hub and what things I was planning on putting into my home.\n\nI have google, and do not have any issues with how it works.", 1, "t3_jg4ay3"], "g9qcqhk": ["Siri", 1, "t3_jg4ay3"], "g9odl8n": ["google", 1, "t3_jg4ay3"], "g9oob5b": ["Google", 1, "t3_jg4ay3"], "g9o84yd": ["Google.", 1, "t3_jg4ay3"], "g9pslsc": ["Google for speech and contextual recognition.  Alexa for better automation support 🤷‍♂️\n\nI specifically run google homes in each room, with GE z wave switch's, SM motion sensors, Samsung ST hub, Abode home security system with z wave door sensors, and z wave smart locks, and wyze security cams.\n\nAlso have about 20 tp Link bulbs, smart outlets, smart coffee maker, 4 chrome casts, an bradlink RF/IR hub, Switch Bot Hub, three robo vacs, and 4 google wifi mesh routers an 100\" automated projector screen, automated blinds, nest thermostat, and various other devices I'm forgetting.", 1, "t3_jg4ay3"]}], "jewjek": ["Nest security system discontinued\n", "https://www.reddit.com/r/smarthome/comments/jewjek/nest_security_system_discontinued/", 1, 2, "smarthome", "security", {"g9gybbi": ["Add to the growing list of reasons to never buy into google products", 1, "t3_jewjek"], "g9gvixw": ["A part of me thinks they have killed this off because it lacks the hardware to to make it CHIP compliant.", 1, "t3_jewjek"]}], "jf872q": ["IoT Security\nI am not sure if I should post this here or a WiFi subreddit. I have numerous connected smart devices. I have a bunch of smart plugs, smart bulbs, cameras, doorbells, thermostat, security system (with cellular backup), etc. I am concerned about the security of these devices. I want to create a separate SSID for these devices off my primary wireless network. Are there any disadvantages to doing this that I am overlooking? At my home, I do use Alexa for most operations so maybe that could be a problem. I oversee a second location that is not integrated with Alexa. The only disadvantage I can think of is having to be aware of which SSID I am connected to during setup of a new device or troubleshooting an existing one. Am I missing something? Thanks. Happy spooky season. 🎃", "https://www.reddit.com/r/smarthome/comments/jf872q/iot_security/", 1, 3, "smarthome", "security", {"g9jec2a": ["A separate SSID is not enough. You can have two separate SSIDs and the devices will still be on the same network and have all the same access.\n\nWhat you want  is a VLAN. A VLAN is a separate network segment and can isolate devices on it from your other network. Once you get the VLAN set up you want to make sure it can route to the internet (assuming these IoT devices need internet) and you'll want to make sure that at least some routing takes place between your normal network and your IoT network so that your phones/tablets/etc that are otherwise unrestricted from you network can talk to the IoT network. \n\nSorry if that's not the most articulate explanation but it's the best I muster at the moment.", 1, "t3_jf872q"], "g9n9uzk": ["Take a look at this:\n\n[https://diymysmarthome.com/5-ways-to-secure-iot-devices/](https://diymysmarthome.com/5-ways-to-secure-iot-devices/)\n\nYou will want to use Vlans &amp; some firewall rules.", 1, "t3_jf872q"], "g9it3yp": ["I'm not sure if the mods would allow it there, but the people in the community over at r/homeassistant may be able to help you out. A lot of them build smarthome systems that function almost entirely locally.", 1, "t3_jf872q"]}]},
{"jfg1q1": ["Skybell\nAnyone have any luck connecting skybell to smartthings hub?", "https://www.reddit.com/r/smarthome/comments/jfg1q1/skybell/", 1, 3, "smarthome", "trust", {"g9kwam1": ["Per ST support, SmartThings has dropped support for SkyBell due to SkyBell not maintaining their platform:\n\n *I  would like to inform you that due to some integration issues with the cloud services, the support for SkyBell HD devices has been removed from SmartThings.* \n\n*From time to time we deprecate support for devices that no longer meet  our quality thresholds for Works With SmartThings certification.*\n\n*I appreciate you sharing your thoughts on SkyBell HD with the new SmartThings app.*\n\nI'm not surprised since SkyBell just screwed over the owners of SkyBell v1 and just bricked them after a few years and shut off the v1 server. Should have learned from that not to trust SkyBell as a company.", 1, "t3_jfg1q1"], "g9jyzud": ["Also curious.", 1, "t3_jfg1q1"], "g9mag79": ["Thanks for replying! Today I finally received my SmartThings hub and I’m really happy with it. I really enjoy Z wave because it won’t clog up my wifi network. Fortunately I got Skybell free and now I understand why.", 1, "t3_jfg1q1"]}], "jg2e49": ["Replace doorbell (outside) and ringer (inside) with 2 smartphones\nSo, if we accept that all of us have smartphones - can someone offer their opinion/advice on replacing doorbells systems with an NFC/QR code system?\n\nFor me, I have a multi-unit property:  \n\\- Scanning the NFC/QR calls a simple webpage  \n\\- the visiting guest could then choose which address/unit they'd like to ring  \n\\- choosing that link (ex: to apartment A) initiates some kind of group call, sms, whatsapp, zoom, [voip.ms](https://voip.ms/) call, etc... some kind of communication \"ding dong\"... some units have multiple roommates - I'd like it of the call could be to a group - video call (zoom-like) would be great\n\nit's this last step that I'm stuck on. can I kindly ask for advice/opinions?\n\nJust a thought - thanks in advance.  \nLib", "https://www.reddit.com/r/smarthome/comments/jg2e49/replace_doorbell_outside_and_ringer_inside_with_2/", 1, 30, "smarthome", "trust", {"g9ny6vu": ["No.  Absolutely not.  Tech is supposed to solve a problem.  Your proposed solution solves no problem.  It adds complexity, both for the user and for whoever manages the system - for the sake of being more \"techy\". \n\nAnd it ignores the fact that a first time visitor just wants to go press unit three A's button.  Not read through an instruction list, and potentially download an app just to be able to ring their apartment.\n\nI have a video doorbell in my home because it solves a problem.  If I didn't care about the video, and somebody suggested I pull out my working doorbell and inside door chime - and install on the outside something like a tablet, there's a big red button that says \"press here\", that then spoke to the cloud - which in turn told my inside Wi-Fi base, doorbell chime to ring one time - I'd say they're on crack.  It's a more technologically advanced solution coming but it doesn't solve a problem.", 3, "t1_g9ntcdj"], "g9nwko2": ["This seems super unnecessary and just doing shit for the sake of doing it. It's an inconvenience.", 3, "t3_jg2e49"], "g9nwecx": ["Okay, while I know exactly how to help, you're not really encouraging me to. Assuming that I'm older just because I think your tech solution is a bad idea is offensive, then your snarky tone in this comment was also unappreciated.\n\nIt seems like you're trying to find a cheap alternative to the far simpler traditional solution. I would honestly hate to be a tennant in a property with this sort of ringer system. It seems like a pain for any guests I invite over, not to mention that the lack of transparency would make me feel like perhaps my landlord was keeping data on visitors, which would make me uncomfortable.\n\nRather than lash out, maybe try listening. This is a bad idea.", 2, "t1_g9nuq65"], "g9nu2e5": ["Even though virtually everyone has a phone with NFC capabilities, not everyone keeps NFC always on, which creates a hassle for them. QR is just a PITA. This is also impractical for anyone whose hands may be full.", 2, "t1_g9ntktp"], "g9nx8ri": ["\"(you must be older than am)\"\n\nThat was rude.  I'm middle aged yet I'm a systems engineer - and I've installed access control systems in large facilities, tied in with video monitoring dozens of times. I always look at the bleeding edge and new ideas. And I can say from a VERY UP-TO-DATE, and professional/experienced prospective your idea sucks ass.  Because there are many easy, reliable, tried and true solutions that already exist.  You're adding complexity for the user and your management, added points of failure - with no added benefit.", 2, "t1_g9ntktp"], "g9nsfsr": ["Honestly, I think this is a terrible idea.", 2, "t3_jg2e49"], "g9o3csn": ["You're describing the point of current smart doorbells. For an apartment, just go the simple route with traditional doorbells and stick a camera with 2-way audio out there, and give access to your residents who can opt to use it if they so choose. Simple, cheap, few points of failure, and everyone is happy.\n\nI recommend choosing one that allows you to grant access to users rather than sharing a single login.", 1, "t1_g9o22vs"], "g9o961y": ["actually - I think I've just figured it out...\n\nThank you all very truly for the discussion - If anyone is interested in my solution, I'd be happy to discuss it with you. I should have usage results/data to report by the end of the year.\n\nSometimes I need to bounce ideas off of others to get my brain working - thank you all for helping me work this out.", 1, "t3_jg2e49"], "g9o2jvq": ["yes - but I can say the same thing about practically every example of an unsolicited QR code I have ever seen... (they're very helpful on setting up WIFI, Tech installs, etc) but that's where we are.", 1, "t1_g9nwko2"], "g9nygom": ["If you're in a restaurant you're sitting on your ass.  And you have people around you who can help you if you don't know what the hell you're supposed to do.  If I walk up to the front door of an apartment building, I sure as hell don't want to have to read through an instruction list, pull out my phone, potentially download a nap. Instead of just pressing a unit's button. \n\nYou keep on getting good advice from people, but arguing it away, instead of engaging in a conversation and considering what folks have to say.   \n\nThat's rude.", 1, "t1_g9nw0ed"], "g9ny6ae": ["Please forgive me - I meant no offense at all. My comment about your age, and your unwillingness to embrace change led to me wondering out loud if it was because you were of an older generation, and therefore didn't like to think outside the box... bad form on my part and I apologize. \n\nI wasn't offended by you saying that my idea was terrible, or that it was a pain in the ass...  on the contrary, I appreciate the candor - but your comments, as of yet, haven't been very helpful... you say you know exactly how to help... but you're keeping that a secret? You only logged in and commented to berate my idea? And that I'm supposed to encourage you?  And I'm the one being rude??\n\nThat strikes me as a bit odd.", 1, "t1_g9nwecx"], "g9oewps": ["My honest opinion is that if I'm being asked to take my phone out to let a friend know I've arrived at their apartment, I'd rather just use my phone to call or text them to let them know I'm there instead of scanning a code that opens my browser and redirects me to god-knows-what sort of other app I'm supposed to use. However it might be promising if it's implemented as a feature to expand accessibility options for those that might need something more than a traditional or video doorbell.", 1, "t1_g9odhhe"], "g9nzr0x": ["totally fair.. but first - give me an example of the last time you scanned a qr, or an NFC in public... what compelled you to do it? for what reason?", 1, "t1_g9nyoje"], "g9o0jij": ["The last QR code I scanned was to set up a smart home device I bought. In public, probably some advertisement when QR first became a thing. I almost never use QR.\n\nI use Samsung Pay on my phone, which uses NFC and MST to make purchases. That's pretty much the only place I use NFC, although I've been looking at some other uses recently.", 1, "t1_g9nzr0x"], "g9o4jfz": ["just to be clear - it's not my intention to be rude.. please don't be offended...\n\n\"you have people around you who can help you if you don't know what the hell you're supposed to do\"... clearly you've never been to Paris...  \n:)", 1, "t1_g9nygom"], "g9o4qaf": ["i appreciate your time\n\nbest wishes", 1, "t1_g9o3csn"], "g9o0wok": ["please read my explanation on why I assumed the other person's age - I truly meant no offense - I can only assume this is a cultural difference... I do apologize.  I just think that offering more than one solution to any given problem, even if you think it's absurd, is a good thing... Also, I'm sure that others may be interested in this kind of solution - perhaps not for a silly doorbell idea, then for something else... isn't that what you lot use BB's for.. to exchange ideas? Good and Bad?\n\n I'm sure you're very accomplished - and I truly appreciate your time.. but... I can't really think of any time I have ever scanned a qr code that offered me any real benefit except for the Menu example I have given.. can you? but that doesn't stop me from exploring their possible benefit.... and I certainly wouldn't lash out at anyone for making it part of their business... If I don't want to scan it, than I don't do it - it's as simple as that.\n\nMaybe it's not the greatest idea -- but I still am a bit stuck on step 3... if anyone is interested in giving it a go and offer helpful comments, I'd be truly grateful.\n\nAnyway - I hope you can except my apology - best wishes.", 1, "t1_g9nx8ri"], "g9oc9ei": ["What's to stop someone from physically replacing any/all of the QR codes with different codes that redirect people to a malicious website that installs malware on someone's phone?", 1, "t3_jg2e49"], "g9x366l": ["so does heroin...", 1, "t1_g9sfpaf"], "g9odhhe": ["Thank you for reading! I appreciate your input - - Great point... NFC can be locked... but I suppose the QR would need to be secured up behind an enclosure... (if I understand you correctly) There should only be need for 1 QR or NFC - the page it takes you to has the virtual doorbell options... :)\n\nThere are also services that will custom make it on ceramic or plastic, or something like that... but behind a glass/plastic enclosure should solve this issue\n\nJust curious - I know others weren't shy about telling me what a bad idea this is... assuming it works well, and is a secondary service to the traditional doorbell... what do you think about it?", 1, "t1_g9oc9ei"], "g9ns3bd": ["Consider the experience of your visitors--essentially strangers. I've never seen anything like this, and it breaks the paradigm I expect for contacting someone. If you go about this, you'd need to make it very obvious (perhaps with signage explaining how to use it), and it shouldn't require me to install any apps on my phone.", 1, "t3_jg2e49"], "g9ntcdj": ["I agree 100% and I have. If one has a phone, then at the very least, they'd be able to make a phone call, or send an sms...\n\nit wouldn't take any real effort to include links to several different clients... ex, \"choose preferred software (sms, zoom, whatsapp, etc), then choose whom to call, etc\"...\n\nps... isn't paradigm shifting the whole purpose of tech?", 1, "t1_g9ns3bd"], "g9ohnul": ["I agree with you - but this is, of course, not for those who are known... I think you get it, though, that it's a secondary feature... I think for safety of everyone, that this should be done either by simple text sms, email, or otherwise... I have a first draft in my head - - but I agree with you.\n\nBTW, thanks for taking the time for a well thought out and respectful response. Best wishes.", 1, "t1_g9oewps"], "g9o4a9q": ["I understand your comment \"Tech is supposed to solve a problem\" but unfortunately that's not always the case... what does TickTock solve? Not looking to argue - that's just my opinion...  There are a million examples of truly useless tech.\n\nYes, I agree that scanning a qr, and then selecting the \"button\" on your screen is an extra step... but c'mon... I bet you know as well as I do that people are smart enough to pass this hurdle... I can think of a million examples of every day items having gotten pretty complex. I still can't get my audi dashboard to work exactly as I want it... (just kidding, but you get the idea)\n\nHow much did your video doorbell cost? Who installed it? Image if you had 10 units to service... and when the wiring fails, how much will that cost?... Aren't those questions thought provoking? Again, not looking to argue - if money were no object, I'm sure I'd go your route - no hesitation.\n\nJust my opinion, but I think more and more, people will find simple and cheap ways to solve problems... my idea.. even though you hate it, offers a way to do everything you fancy doorbell does... for free. No install, no purchase, no upkeep or replacing when it fails... free. \n\nThe only cost is to ask the guest to think a little bit... and in that case, you are right.. that's expensive.", 1, "t1_g9ny6vu"], "g9o22vs": ["EXACTLY!!!\n\nYou haven't scanned a QR in a decade... and practically NO ONE is using NFC widely outside of payment.\n\nI agree with you 100% QR (as with most new or underused tech) is used poorly - someone in marketing says \"hey I've got an idea. Let's have someone do \\_\\_\\_\\_\\_\\_\\_\\_\\_\"  And it's usually a bad outcome.\n\nYes, my experience is similar to yours in both QR and NFC... HOWEVER... that doesn't mean that it's a dead animal.\n\nLook - you hate my idea - fine.. but ALONG with the doorbells at the entryway... there is also a qr/nfc... as people get more comfortable with this sort of thing.. don't you think someone might... just might... scan it... and realize they may want to opt to shoot their host a quick text, or have a video chat?\n\nYou may not... but trust me... some people would... ok, maybe just me...", 1, "t1_g9o0jij"]}]},
{"jgf5wn": ["Hold up.... we now have a subscription plan for a vacuum...\nIs it April already? No? I guess they are serious. \n\n[https://select.irobot.com/store/product](https://select.irobot.com/store/product)\n\n$200 down gets you the hardware and a month of service, cancel anytime you like, don't need to send it back, but you can't use the robot without the $25/mo service plan. So im guessing ET needs to phone home at least once a month to know you paid the bills? Maybe it has cellular built in? they make no mention of internet service being \"required\" After two years you could have just bought the unit outright but you still don't own it. \n\n&amp;#x200B;\n\nShould I buy one? how long until someone hacks the vacuum for work for free? 200 bucks would be a good deal lol.", "https://www.reddit.com/r/homeautomation/comments/jgf5wn/hold_up_we_now_have_a_subscription_plan_for_a/", 1, 92, "homeautomation", "privacy", {"g9q7w9i": ["It won’t work for free it grabs all its mapping from their services. Seems like a bad deal. It’ll only take 2years for the monthly payments to eclipse the cost of the vacuum.", 1, "t3_jgf5wn"], "g9q9jem": ["*- Do I ever own the robot?*\n\n*You own it! If you cancel your iRobot Select membership there is no need to send your robot back. Note that the Roomba® i7+ robot vacuum and Clean Base® Automatic Dirt Disposal will only operate with an active iRobot Select membership. You can resume robot operation by reactivating your iRobot Select membership whenever you choose.*\n\nWow. YOU OWN IT, but you CAN'T USE IT unless you pay us. The unit cost $800 to own-for-real. The not-a-lease deal is $200 + $25/month - in 24 months, you'll have paid that price. But the cost could go up (or down) :\n\n*The iRobot Select membership program may evolve over time, we will keep our members informed of any changes as they arise.*\n\nNow, I fully admit, this does include maintenance items (filters, brushes, bags, etc), so that amounts to something. The more you use it, the better the deal.\n\nI just bought a Roborock S6 Pure for $400 (Prime day), and it is working great so far. The LIDAR on this thing is great and the mop is integrated. :)", 1, "t3_jgf5wn"], "g9qb8up": ["I pay monthly for vacuuming, too.  A bit more than $25, but she also mops, dusts, and cleans the bathrooms.", 1, "t3_jgf5wn"], "g9rkqmd": ["yeah, I'm not sure the selling point of \"Our products are so shitty, you need a monthly maintenance contract, 'cause it will totally break down\" is a really solid idea", 1, "t1_g9qyhkv"], "g9rjizr": ["I don’t have a business degree but even I can understand how $90k/month to completely cover the need is a better choice than a $1.7mil upfront capital purchase that will almost immediately depreciate to a fraction of that value, *plus* the overhead of planning and setup, plus the operating costs which likely include at least one human salary. It takes 1.5 years before that outright purchase actually breaks even with the service option, just on device cost alone, and that’s assuming the device doesn’t break in the meantime and require you to spend another $1.7mil to replace it.", 1, "t1_g9rd9o4"], "g9rk6ko": ["I chuckled.  Thanks.", 1, "t1_g9r08uf"], "g9qiqhv": ["It's called Device-as-a-Service, part of the whole \\*-as-a-Service fad that's taking the business world by storm.\n\nIt makes sense for businesses, because it removes the huge upfront cost of buying 100 pieces of an equipment (e.g. printers, laptops, etc) and also takes care of maintenance for you. Just need to pony up a monthly sum to essentially have the item without any of the problems.\n\nDoesn't make as much sense for consumers who aren't trying to maintain a fleet of robot vacuums.", 1, "t3_jgf5wn"], "g9qglem": ["And there goes my desire to buy one...", 1, "t3_jgf5wn"], "g9qk7nm": ["Could you imagine how unbearable a room full of roombas would be?", 1, "t1_g9qiqhv"], "g9qyhkv": ["i think this actually makes sense, especially if maintenance is included. with all the little things that can go wrong, you'd typically replace the machine once every couple (or few) years anyway. one software bug out of warranty can easily brick the thing, and you don't want to be stuck with a (reasonably large) paperweight, especially if you paid upfront for it.\n\nwith the subscription, as long as you think the money you're spending is worth it, you can always walk away anytime, and pick up the next best thing.", 1, "t3_jgf5wn"], "g9r05ia": ["Not to mention that a set of spare brushes and all usually costs around €20-25, and they'll last a while.", 1, "t1_g9q9jem"], "g9s3ldm": ["I'd like to test it out on my back patio as it gets covered with falling leaves.", 1, "t1_g9ri5hg"], "g9s67sk": ["I understand the mentality, but why the hostility? Of course I'd rather buy an American made or designed product (I use iPhone for example), but if proper competition comes (let's face it, LIDAR is better than cameras for a robovac) and at a better price, why wouldn't I support that?", 1, "t1_g9rugew"], "g9s4igg": ["The cleaner was only charging £10 a week? That's damn cheap!", 1, "t1_g9rxys4"], "g9s88f2": ["If you don't let that sink in, where are you going to brush your teeth? Over the toilet?", 1, "t1_g9r6psd"], "g9scw9i": ["I eagerly await the folks hacking this. $200 is a steal and hacking your own items is protected now. Once it's jailbroken it'll be a race to get one and get it airgapped before they update the firmware, but I will definitely be on the lookout.", 1, "t3_jgf5wn"], "g9scplp": ["\" **If your Robot and Dock are not connected to the Internet, your Membership, including SmartCare, may not work as described or may be interrupted.** \"", 1, "t3_jgf5wn"], "g9scvud": ["I can never get past the immense amount of waste that takes place as a result of this too. Say you buy one of these for $200 + $25 / month. Then two years down the line they introduce a new one that's a lot better. Well, you can stick with your old one or \"buy\" a new one for $200(?) + the same $25 / month. All of a sudden a device that would work perfectly fine for someone if it wasn't locked to some bullshit subscription service is pretty much useless. No one is going to buy it because they can just get their own brand new subscription robot vac for not much less than what they'd pay for this new one. So out it goes.", 1, "t1_g9q7ppu"], "g9s5kdj": ["... For 15 seconds I was like \"oh that's kinda neat. It's a service plan!\n\nThen I read the \"but it won't function \"\n\nFucking hell I'm appalled", 1, "t1_g9q9jem"], "g9si3ch": ["Rimshot! I'll be here all week. Don't forget to tip your waitress!", 1, "t1_g9s88f2"], "g9re2w7": ["&gt;The value isn't for you, dear consumer. The value is for the shareholders.\n\nThis comment makes no sense. There is no shareholder value here because there is no business value here.", 1, "t1_g9rcokh"], "g9s1b6l": ["I think it's more consumables. To prevent copies. Barcode on the roller, spinning feet and the bag or similar. Ensures they get money back from all the r&amp;d + qc standards and warranty can be honoured if it breaks using their own parts.", 1, "t1_g9ry1oe"], "g9skwyk": ["Fair enough...hope you realize how many things are made in China even for American companies. Roomba's are not made here either :\n\n[https://investor.irobot.com/news-releases/news-release-details/irobot-commences-manufacturing-operations-malaysia](https://investor.irobot.com/news-releases/news-release-details/irobot-commences-manufacturing-operations-malaysia) (it states they manufacture in China)", 1, "t1_g9sbz8m"], "g9q7ppu": ["I see absolutely no value in this.\n\nWhat's the upside here, access to an experience manager, and equipment protection?\n\nIf the vacuum was replaced every 2 years with a new model, then maybe. \n\nSo that vacuum costs about$40 a month for the first year (1 payment of 200, 11 of 25) and 25 a month after. To use a vacuum cleaner that arguably performs ⅓ as good as a human might. \n\nI say, save the money and hire a cleaning crew to come in to clean the house once every other month.", 1, "t3_jgf5wn"], "g9qi7py": ["My Roomba 650 cost about $300 8-10 years ago. I’ve replaced the battery, the motors, I’ve bought several sets of brushes over the years and maybe paid $200 for spare parts.  He (Gerald) is still going strong with $500 invested. \n\nTheir sales model would cost me $2,575 so far.  I get $200 + (12x25) x 8 minus $25 for the first month. \n\nSo no.  It’s not worth it.  My little room a 650 is a friggin tank.  Works every day.  \n\nA new one from a different company is bigger, gets stuck under the coffee table or in the kitchen it gets hung up on the fatigue mats we have. Doesn’t work 80% of the time.  \n\nStick with old tech is my suggestion.", 1, "t3_jgf5wn"]}], "jg5i95": ["Is creating a complete smart home with zero internet possible?\nIm planning on creating my own smart home from scratch but im not fond of the lack of privacy with google or amazon.\n\nIs it possible to create a 100% offline smart home?\n\nAlso is there such a thing as an offline voice assistant? (Not a deal breaker but thought id ask while im here.)\n\nIf it isnt, i think i can probably work around them with a dummy google account (though im sure even that would cost me some privacy) but would rather have nothing to do with them at all.\n\nFor the record i do HAVE the internet, so can use it to update device firmware etc, i just dont want things on the net long term.\n\nThanks.", "https://www.reddit.com/r/homeautomation/comments/jg5i95/is_creating_a_complete_smart_home_with_zero/", 1, 10, "homeautomation", "privacy", {"g9oe5wl": ["There are a few options, home assistant is able to operate entirely locally aside from the initial installs. There are a few voice assistant options for it such as Rhasspy or Ada but personally I’ve not tried either. Ultimately having a decent dashboard available on any device and well set up automations means you don’t need a voice assistant for control, and if you don’t want one connected to the internet not sure what else you’d want to use it for?", 1, "t3_jg5i95"], "g9p9z4l": ["The only thing I'd sacrifice if my Internet went down was remote control and alexa integration.  I don't have a local voice assistant and not ready to go down that path yet, but I have zero Internet required items.  Granted, it was designed and items purchased specifically for that purpose, so if you buy random crap, it may or may not work.", 1, "t1_g9o9ghx"], "g9pcwhz": ["Most of the more common devices will work offline, but most need internet access for setup.  wemo, kasa, hue, etc.  You may need an aftermarket app, many manufacturer apps will not work natively without a connection  - they need you to logon. Watch out for those that do cloud authentication/authorization, e.g. smartlife / tuya, as they generally won't run natively without an initial connection.", 1, "t3_jg5i95"], "g9pd465": ["Absent a HomeKit hub, HomeKit is 100% local. The devices themselves may connect to the internet but you can block that as it’s not needed for HomeKit.", 1, "t3_jg5i95"], "g9o9ghx": ["100% is subjective. You can do offline but you're going to sacrifice things, like a lot of things. Also there is no voice assistant that works without an internet connection, unless you wanna make one yourself.", 1, "t3_jg5i95"], "g9o9ljl": ["Youch, done a bit of programming but i think making my own voice assistant is a bit beyond me. Haha.", 1, "t1_g9o9ghx"], "g9q5ydv": ["100% YES", 1, "t3_jg5i95"], "g9ofjjw": ["Yes, you can create a 100% offline smart home. For instance, install a home automation system that puts local control first, such as [Home Assistant](https://www.home-assistant.io/), and don't use any of its integrations with online services. Another interesting system, focusing on privacy, is [Candle](https://www.candlesmarthome.com/). For an even more DIY approach, I have written a book about creating a fully offline home automation system based on MQTT: [Control Your Home with Raspberry Pi](https://koen.vervloesem.eu/books/control-your-home-with-raspberry-pi/).\n\nFor an offline voice assistant, I recommend [Rhasspy](https://rhasspy.readthedocs.io/en/latest/) (disclaimer: I'm a contributor). Note that this is more a voice assistant *toolkit* than a ready-to-use voice assistant. However, it has a very welcoming [community](https://community.rhasspy.org/).\n\nSo in short, a 100% offline smart home is possible, but it's evidently not as user-friendly as existing cloud-based systems.", 1, "t3_jg5i95"], "g9odd24": ["There is some offline voice assistant things happening \n\n\nhttps://rhasspy.readthedocs.io/en/latest/ is one of them", 1, "t3_jg5i95"], "g9opwt1": ["It’s no problem at all without internet. With the exception of voice control. You CAN do voice control with some local solutions, but they might not be as good as the big cloud ones. Everything else can be done locally. \n\nFor 1, use Zwave or zigbee devices, those are local by default.\n\nThen get a controller like home assistant or others.", 1, "t3_jg5i95"]}], "jfhhga": ["Personal Cloud from home with Nextcloud and Raspberry Pi\nIn this video we will install Nextcloud on a Raspberry Pi 4 so we can upload our files from mobile and desktop devices just like Google Drive, OneDrive, Dropbox and others, but directly to our homes with a lot more privacy. \n\nIn a times where pretty much every big company tracks you down from everywhere and it is almost impossible to escape them if you are using Internet. Nextcloud and a local computer is kind of fresh air of personal privacy.  \n\nWait a minute here, you may ask what is Nextcloud? \n\nNextcloud is an open-source project that you can install on your local device. It allows you to control and upload \n\ndocuments, pictures, and everything you wish on your own personal computer at home. And not on the Google, Microsoft or Amazon cloud.\n\nTo successfully implement this you will need:   \n\n\n* A Raspberry Pi (where Raspberry Pi 4 is recommended) with installed RaspberryOS and secure shell access to it.\n* You will also need a public static IP contact your internet service provider for that\n* Of course You will need some kind of storage the more the better. If you want to store your pictures and videos you will need a lot, but if you want to save only important documents several gigabytes will be enough.\n\nFor the demo I will use a SD card for the RaspberryOS and a USB flash drive for the Nextcloud storage. It is recommended to use SSD drives if you have some around. \n\nNow let's install Nextcloud on a Raspberry pi to see what will happen:\n\nThe Video 🔴 🎥 [https://youtu.be/YENbrYUd9SA](https://youtu.be/YENbrYUd9SA)\n\n[Personal Cloud from home with Nextcloud and Raspberry Pi](https://preview.redd.it/epnjxlv5hhu51.jpg?width=360&amp;format=pjpg&amp;auto=webp&amp;s=38cd6264b360496d88733d3b5a1ff24c5ed94c17)\n\nIf you prefer to read, this is the full Article ✍️📜 [https://peyanski.com/personal-cloud-from-home-nextcloud-on-raspberry-pi/](https://peyanski.com/personal-cloud-from-home-nextcloud-on-raspberry-pi/)\n\nAnd Web Story specially optimised for mobile devices (insta like) 📲 \n\n➡️ [https://peyanski.com/web-stories/install-nextcloud-on-raspberry-pi/](https://peyanski.com/web-stories/install-nextcloud-on-raspberry-pi/)\n\nCheers,\n\nKiril", "https://www.reddit.com/r/homeautomation/comments/jfhhga/personal_cloud_from_home_with_nextcloud_and/", 1, 13, "homeautomation", "privacy", {"g9myi5g": ["You don’t need a public static IP if you set up dynamic dns. You can buy your own hostname (mine is sort of like nextcloud.mydomain.com) or you can use a service like duckdns.com. Duckdns is free, but owning a domain is relatively cheap. I think mine is $12/yr.", 1, "t1_g9mvfs3"], "g9oo84n": ["Yes, you can access and edit your files remotely in multiple ways", 1, "t1_g9lmvlr"], "g9mz2yi": ["I use NoIP's free tier which just requires periodic reactivation by clicking a link on their website.", 1, "t1_g9myi5g"], "g9nd64u": ["Seems pretty reasonable to me, I'll be looking into this, thanks!", 1, "t1_g9nd1dw"], "g9nd1dw": ["I found that to be annoying so I chose a DNS provider that allowed API access and I run a nightly process to update the DNS entry for my home. \n\nIt costs me $0.51 per month with Amazon route 53. $0.50 is for the hosted zone and the $0.01 is usage and covers me up to 1,000,000 queries. I had 5,800 queries last month and that includes my MX records as I use my own domain name for emails.", 1, "t1_g9mz2yi"], "g9ooak7": ["nice, setup", 1, "t1_g9lyk2q"], "g9opec2": ["nice one, good job", 1, "t1_g9nd1dw"], "g9op01b": ["you can use any free DDNS service, but you have to take care of the ip updates (usually a one cron job scheduled to run occasionally will do the job)", 1, "t1_g9mvfs3"], "g9lmvlr": ["Pretty sure I know the answer to this but want to confirm; can you access this remotely? Like if I’m at the doctors office and need a document can I pull it up?", 1, "t3_jfhhga"], "g9lp6iv": ["I have not seen the video linked above so I don’t know if the subject is covered here... but yes, that can be set up. It’s how I use Nextcloud on my unRaid server. It’s accessible from anywhere, all of my family phones, laptops, etc all sync with it at home and on the go. Also accessible from any browser via web GUI.", 1, "t1_g9lmvlr"], "g9lyk2q": ["Also have NC deployed via Unraid, mine is accessible from anywhere via a Wireguard tunnel.", 1, "t1_g9lp6iv"], "g9op6j0": ["I used to use NoIP as well, but it is very annoying. Now I switched to duckdns and I don't have to do anything", 1, "t1_g9mz2yi"], "g9mvfs3": ["Does this mean we don't need a public static IP? (Lol, almost typed public static void)", 1, "t1_g9lyk2q"]}], "jg50lj": ["If a service provider monitors my smart home, am I giving up my privacy?\nI'm very new to automating my home (installing smart plugs, bulbs, alarm system, thermostats, Alexa, and AppleTV). If it were feasible for my ISP to monitor my smart home, would they technically have access to my privacy?  \n\n[View Poll](https://www.reddit.com/poll/jg50lj)", "https://www.reddit.com/r/homeautomation/comments/jg50lj/if_a_service_provider_monitors_my_smart_home_am_i/", 1, 3, "homeautomation", "privacy", {"g9oe0nb": ["Depends, I believe there are ways to extract information that don’t dive into your private data so it remains encrypted.", 1, "t3_jg50lj"], "g9oclot": ["Thank you for this awesome share", 1, "t3_jg50lj"], "g9pfndc": ["Ask yourself the question...  \"If I'm not paying for it, how is the vendor making money?\"  And even if you are paying for it, you're probably not paying so much that it eliminates the motivation of a company to sell your data to someone else for more money.\n\nPersonally, I'd never allow any piece of home automation equipment to connect to the public internet.  If something isn't in WiFi range, then it's not on my network.", 1, "t3_jg50lj"]}]},
{"jb393t": ["Mega \"Reasons to Avoid WiFi Products\" thread\nThird installment in what's become my \"Mega\" articles. See \"[Getting Started\"](https://www.reddit.com/r/homeautomation/comments/f7ezgt/mega_getting_started_thread/) and \"[reviews](https://www.reddit.com/r/homeautomation/comments/j9wih0/personal_mega_review_thread/)\".\n\n\nWiFi devices are common, and appealing since they usually don't require a hub/bridge/router/switch/controller. This makes Wifi devices a great choice for beginners. I don't want to discourage beginners from taking the leap into smart hominess, but it is best to avoid WiFi. Sometimes that's not possible  or impractical (eg security cameras and tvs), but otherwise buying any WiFi product should be considered a temporary solution. What works for one device may not work for 10. Below are the reasons why, and some of these only manifest after having numerous devices, and/or compound with many devices.\n\n1) Different devices have different network needs of speed vs bandwidth. Phones, tvs, etc., require a balance between number of requests (latency) and data usage (bandwidth). Smart home products make many tiny requests, often with a need for super fast response times (eg you will notice any delay over about 100ms when turning on a light, but you aren't going to notice the buffer bar of YouTube being 50ms shorter). Too many requests can slow a router that is designed for higher throughput and fewer connections.  This is true for any network, but adding home automation devices to a home network compounds the risk. Not only can home automation suffer from playing a video game while streaming video, but playing a video game can suffer from home automation devices. It would be best to separate high bandwidth from high request devices to separate networks - see #6.\n\n2) Inference is a bitch! Interference isn't just caused by two sets of signals drowning each other out... Electromagnetic waves bounce off of (or bent by) obstacles, like walls, which create eddies. Interference can cause lag, lost data, less range, lower signal strength, and dead zones, which makes it particularly hard to diagnose. While interference can happen with any network, WiFi uses longer-range, higher power signals than ZigBee or Z-Wave, therefore all-else-equal will have more interference. Device placement within the topography of a home can also affect interference. Home automation devices tend to be scattered haphazardly, which logically would result in more interference, and also makes it more likely for one to be in a dead zone.\n\n3) ZigBee and Z-Wave are as secure as possible short of using candles, since they have a limited command structure. Although an attacker could (hypothetically) send a command like \"turn off\", they can't send an unexpected command, and there's far less potential for \"malformed packets\". ZigBee and Z-Wave devices are essentially unhackable.\n\n4) By combining home automation with internet devices, they essentially share security risks. The types of exploits used for a smartphone are different than those used for a thermostat or a Hue. High value targets like computers put smart home products at risk - and often unsecure smart home products put computers at risk. And smart home products that use apps... are both. It would be best to separate devices that require internet to separate networks - see #6.)\n\n5) Despite \"mesh WiFi\" routers being a thing, WiFi is not mesh. ZigBee and Z-Wave *devices* act as repeaters. In general, more devices will cause a WiFi network to get worse and decrease range. In general, Z-Wave and ZigBee networks get stronger and increase range.\n\n6) WiFi has a hard maximum of 255 devices, often far less depending on the router (see #1). That's comparable to ZigBee and Z-Wave controllers, but if you reach the device limit (or if #1), bridging multiple WiFi networks can be pretty difficult. However, it's typically easy to bridge multiple ZigBee and Z-Wave networks. Indeed, ZigBee has a theoretical maximum of ~15 million devices, so it's not bridging networks, it's essentially connecting two controllers to one network. (Z-Wave has a maximum of 255 devices per network.)\n\n7) While many people cite price as a reason to use WiFi, the reverse can be the true. While WiFi devices can be bought on the cheap, comparing brand-to-brand prices are equivalent (eg comparing Hue to LifX, or Sengled to Gledopto). More to the point, (if #1, #4, or #6) a decent WiFi router  range from $200 to $400. Even if you already have quality router, that cost can't be ignored because #1, #4, and #6. A ZigBee or Z-Wave \"router\" (ie SmartThings, Hubitat Elevation, hass, Hue hub, etc.) range from $75 to $150.\n\n8) WiFi devices are often harder to install. This ranges from YAH (Yet Another Hub) to YAA (Yet Another App) to entering the WiFi password to setting a dedicated IP. If you have decent security practices, it becomes yet more difficult with the potential for setting up port forwarding, adding a firewall rule, and/or excluding the device from internet access. While that can apply to Z-Wave and ZigBee, it would only be for the hub/bridge (like the Hue hub, rather than an individual LifX bulb). See #3.\n\n9) WiFi devices can have hidden maintenance headaches should you need to change the network name, password, and/or router IP. Additionally, devices many require being reset or reconnected if the internet router is changed, even for an identical model. Specifically, my Hue hub required a factory reset. Z-Wave can have a similar issue where either the radio needs to replicate the network id, or devices need to be \"excluded\".\n\n10) Using (or integrating) WiFi devices can also be difficult (or outright impossible) with apps, custom drivers, or gawd forbid 3 party cloud servers going through IFTTT to a 5th party cloud server.\n\n11) WiFi devices will often be exposed to anyone on the WiFi network just by downloading an app, so after having a few too many, Uncle Ralph could think turning the lights and sprinklers on and off is a real hoot. This is easy to get around, by having a \"guest password\", but it's not something most people do.\n\n12) Finally, it's easier to switch control platforms with ZigBee or Z-Wave devices such as from Hubitat Elevation to Home Assistant. Although it can be very difficult, at worst it's a repetition of having added them to begin with. The equivalent for WiFi of switching from Windows to Apple or from Android to iOS would most likely be impossible. While most people don't switch, home automation - while never future proof - should be built for the long term. Will the 38 Android apps for the Chinese sensors, switches, lights, etc., still be able to run in 15 years?", "https://www.reddit.com/r/homeautomation/comments/jb393t/mega_reasons_to_avoid_wifi_products_thread/", 1, 277, "homeautomation", "security", {"g9icp8o": ["There is a lot I don't know or understand about ZigBee and Z-Wave networks, but as far as the devices are concerned, what they can receive and send is very limited. Essentially, tZigBee/Z-Wave are equal parts network protocol and API. That is what makes them inherently more secure.  It has literally nothing to do with encryption. Even if a ZigBee/Z-Wave network could be penetrated - which is likely possible - all that is exposed are light bulbs, motion sensors, buttons, etc.. At worst, lock codes. They don't allow extracting or injecting data that isn't exposed on the network to begin with. My IoT network is connected to my WiFi/tcp-ip network through a controller/bridge. There is basically zero concern that ZigBee/Z-Wave could be used to penetrate my home network. The only way to do it would be to force-connect a rogue device, and then send a malformed packet to the controller - but you'd need to know what controller (and it have an unpatched hole of catastrophic proportions). The concern is not my neighborhood crackhead sitting in my front yard trying to attack my network. It's an organized crime syndicate on another continent using a zero-day attack on my computer or phone - or a hijacked WiFi device - to steal or ransom all my data. Even there, ZigBee/Z-Wave offer a layer of protection, even if it doesn't contain any data I would care about. If the only issue is my lightbulbs, they aren't going to be able to take out a mortgage in my name, and they better not ask too much ransom, since they ain't that expensive. Bottom line, the issue is what risk IoT devices pose to my *actual data and accounts*. With WiFi devices, that's a real threat. With ZigBee and Z-Wave, it a very low threat.", 1, "t1_g9iavyu"], "g9ifb3s": ["&gt;Why do you need a backup and restore? Do you not remember your SSID name? Your password? Nothing else matters.  \n&gt;  \n&gt;My Hue disagrees with you.\n\nYou did it wrong.\n\n&amp;#x200B;\n\n&gt;Devices don't need static IPs (any device that requires a static IP is busted by design).  \n&gt;  \n&gt;Unless of course, you use static IPs. In which case, your devices may not work too well without resetting them.  \n&gt;  \n&gt;I find it rather aggravating that half of people are saying how you don't need static IPs, while the other half say you don't need to grant every device internet access... Not that it's your problem other people point to a different issue, but can't have it both ways.\n\nOr just simply re-use the same IP space/VLAN scheme on the new device (router/AP/switch whatever) and then your static IPs still apply.", 1, "t1_g8v8ug5"], "g9igrx6": ["A wireless network can interfere with itself.\n\nAll electromagnetic signals will suffer from interference.\n\nHopefully, that's clear enough for you. Here's more info, if you want the concept explained in more depth:\n\nhttps://en.m.wikipedia.org/wiki/Wave_interference", 1, "t1_g9igdo4"], "g9jp7v9": ["so you refuse to acknowledge anyone else's view point?  I can go to the IEEE and read exactly how 802.11 works.  Can you say the same for Zwave?", 1, "t1_g9ig2t4"], "g9jp2i8": ["Have you read my other comments, or are you just trolling and refusing to actually what people are saying?", 1, "t1_g9ig6xs"], "g9jqnts": ["You dont think that if some one gets into said zigbee/zwave network and gains access to the bulb they can't re-flash it with custom firmware and take over your entire home IoT system?  Also...if your IoT network is bridged by a controller and your zwave network is essentially a stub network, how is that zwave controller preventing access?  Do you know what security mechanisms it has in place?  How is it better than a FW? It certainly seems to be that you are essentially bridging your zwave network to you home network if you access any sort of controller via IP.", 1, "t1_g9icp8o"], "g9jrf9u": ["Good for you. Did you have a point? I don't need to do any of that with ZigBee and Z-Wave. Hence why 802.11 is not as good for IoT.", 1, "t1_g9jr06z"], "g9jrlop": ["Enjoy your Yugo that you haggled up to the price of a Raptor.", 1, "t1_g9jreex"], "g9jrur9": ["Because Z-Wave and ZigBee are equal parts API as transport protocol. I've said this before. You can't use Z-Wave to transmit a video clip, or a zip package, or a program. You can use it to transmit the state of a lightbulb, or a request to change that state.", 1, "t1_g9jra6r"], "g9jpvr5": ["Z-Wave, no. If you want to play the lie that you don't use a proprietary router or proprietary car or laundry detergent, then... Use ZigBee. Wtf is your point?", 1, "t1_g9jp7v9"], "g9jreex": ["This is a pointless argument.  Enjoy your Model T.  I'll be cruising around in a Telsa with autopilot.", 1, "t1_g9jr9ns"], "g9jxs3a": ["[deleted]", 1, "t1_g9jxijr"], "g9kf82t": ["&gt; Wifi is not inherently insecure.\n\nBullshit.\n\n&gt; You continue to refuse to acknowledge any information I put forward on how to secure your network along with comments others have made. Yes, a lightbulb doesn't have PII on it like maybe your laptop does. But it certainly can be re-flashed and turned into a bot that carries out other malicious intent. \n\nI have no need to \"secure\" my ZigBee and Z-Wave network. Hence why WiFi is unsuited for IoT.\n\n\n&gt; I'll gladly spend a single hour cracking your zwave network.\n\nOkay. As I said, I'm not concerned about the neighborhood crackhead sitting in my yard. The fact that you can't figure out how to insert a malicious rock through a window in less than an hour means I'm even less concerned about you.\n\n&gt;You are so stuck in your own dogma and misunderstanding of how networks function that you are unwilling to have a proper open minded conversation. Instead you decided your technology of choice was the only way and everything else is fatally flawed.\n\nIs anything in the post incorrect? Or have I asked you that before?\n\n&gt; I was hoping you'd help shed some light on the pros and cons and really its just a post fill with trash and you can't even fully explain your own technology to sufficiently convince me that there are benefits to using alternative wireless technology than what I've already invested in.\n\nI've provided 12 reasons. Not all apply to every or every home automation setup, but I'll leave it to you to decide which. Obviously, several apply universally to all wifi networks.\n\n&gt; There isn't a right and wrong technology per-say.\n\nTrue. There's work and doesn't work, better and worse, more effort and easier, more flexible and constraining, etc.\n\n&gt; But for you to come on this sub and act like you understand 802.11 technologies when it's very obvious you don't by your own comments is doing anyone who might read this thread a disservice when making their own technology decisions.\n\nIs anything in the post incorrect? Or have I already asked you if I've already asked you again?", 1, "t1_g9kdnji"], "g8v1r5o": ["How has Z-Wave or ZigBee been exploited?", 1, "t1_g8tj78z"], "g8v3zzu": ["\n&gt; Except you absolutely can. Did you just ignore what I wrote?\n\nHonestly, I've never noticed a backup and restore option with  a router. If that's a thing... So what? It still is a bigger issue with WiFi networks, and it's *more commonly* addressed in automation controllers. \n\n&gt; Do you normally expect to have wifi at homes you visit? \"Hi boxsterguy, nice to see you. What's your wifi password?\" Seems kinda rude and presumptive to me.\n\nDepends on the who and the circumstances. But don't worry... I was being facetious about visiting you. I don't even know where you live, or who the hell you are. Because the world doesn't revolve around what you don't do. Everyone else is free to give their WiFi passwords to friends and family. Or use a guest password. Or risk Uncle Ralph playing the asshole on the odd New Years Eve.\n\n&gt; Name them? What devices are you using? I thought you had 38 apps?\n\nHome, Nest, Hue, Roku, Arlo, Jinvoo, Mi Home, Home Remote, Lutron, GE Laundry, and Smart Things. Granted, I don't know what two of them do, but they don't look like the others. I don't have 38, because I avoid WiFi devices (and because we haven't bought a GE stove, which... yes, has a different app than Laundry, because why not).\n\n\n&gt; If you choose to use ESP8266 devices without flashing them to ESPHome or Tasmota, that's entirely on you. That should cover most no-name stuff. Otherwise you're talking about well-known brand names like LIFX and TP-Link.\n\nWhy would I want to flash something just to still have all the other issues with WiFi?! If you want to go through all that effort to save, what... $8? That's fine. I'm not even coming to your house, so why would I care? More to the point....what's your point? Are you just sharing everything but your wifi password, or do you disagree with something I said?", 1, "t1_g8u4i4f"], "g8v2wd1": ["How is a Kasa switch \"more intuitive and user friendly\" than GE? Aren't they both paddle switches? Push the top for on, bottom for off...?\n\nBTW, there are $20 switches, though I wouldn't neccessarily recommend them. Comparing GE switches to Kasa switches would be like comparing an electrical product made by a American company known for making quality electrical products for 130 years and an electrical product made by a company known for making for making outlets for a year and fifteen days. Being UL Listed is good enough for me, and sounds like that's true for you, but name brands cost more. That has nothing to do with being WiFi.", 1, "t1_g8tumoq"], "g8v6dxh": ["&gt; Honestly, I've never noticed a backup and restore option with  a router.\n\nWhy do you need a backup and restore?  Do you not remember your SSID name?  Your password?  Nothing else matters.  DHCP reservations don't matter.  Devices don't need static IPs (any device that requires a static IP is busted by design).  As long as your device knows the SSID and password, and as long as those didn't change when you changed your router, they will connect (you might need to power cycle some devices if they don't refresh on their own, but that's it).\n\n&gt; Home, Nest, Hue, Roku, Arlo, Jinvoo, Mi Home, Home Remote, Lutron, GE Laundry, and Smart Things.\n\nLet's see:\n\n* I assume Home = Google Home.  Google is a big company, not going to go under any time soon, and they seem committed to Google Home\n* Hue is Zigbee.  If Phillips ever stops doing Hue, you can ditch the Hue Hub and app and use any old Zigbee hub.\n* Roku isn't going anywhere soon, but I wouldn't count that in the \"Home Automation\" space\n* Arlo is your own fault for buying into an ecosystem of cameras instead of simply RTSP cameras and something like Blue Iris.\n* Jinvoo is [flashable](https://github.com/ct-Open-Source/tuya-convert/issues/149).  This is one of those Chinesium drop shipped things, it appears\n* Mi Home.  That's another Zigbee hub, right?  For someone who \"understands\" this stuff, you sure seem not to understand it.\n* Home Remote. [Assuming it's this](https://play.google.com/store/apps/details?id=com.thehomeremote.homeremote&amp;hl=en&amp;gl=US), that's a \"hub of hubs\" or an overall home automation controller.  Like Home Assistant, but for some reason you want to run it on your phone.\n* Lutron (presumably Caseta) is its own network, not wifi and not Zigbee or Z-Wave.  Why did you add yet another network of home automation?\n* GE Laundry.  That's just par for the course with appliances, if you don't stick to a single brand like LG (Thinq) or Samsung (SmartThings).\n* Smart Things.  Yet another Zigbee/Z-Wave hub.  That's now three Zigbee hubs and four total non-wifi home automation networks.  WTF?\n\nAside from Jinvoo and maybe Arlo, you're either being silly (complaining that you need an app for Hue or Smart Things to bridge from Zigbee/Z-Wave to your LAN) or those aren't home automation.\n\n&gt; Why would I want to flash something just to still have all the other issues with WiFi?!\n\nBecause you've made up those issues and are about 90% wrong in your assessment.\n\n&gt; what's your point?\n\nYour arguments are bad and you should feel bad?", 1, "t1_g8v3zzu"], "g8w6hhp": ["&gt;&gt;&gt; It's when they're on the same or similar channels that they cause interference. Same for wifi.\n\n&gt;&gt;How would two networks on same or similar channels cause more interference than a single larger network?\n\n&gt;Two zigbee networks will cause similar interference as two wifi networks\n\nHow would two networks on same or similar channels cause more interference than a single larger network?\n\n&gt; That's not true. The router has a number you can change in the web interface while the Hue Hub would require you to hack it and install custom firmware.\n\nSo you're saying that TP-Link put a \"number\" in the software in order to advertise that their router supports a limited number of devices, despite that it secretly has the same capacity as other models of routers that they make costing several times more? Odd that so many tech savvy people pay more for routers that are advertised as having better numbers. You have a source for cheap routers secretly hide unlimited capacity?\n\n\n&gt; Not sure what you're trying to say here. Are you suggesting an AP can't be hooked up by running ethernet to it? Because if so that's incorrect\n\nSimiliar to TP-Link, I've secretly hidden what I meant behind the exact meaning of the words that I said, which is that you've missed you're calling as an official Hue hub installer.\n\n&gt;Ok, so your Z-wave controller has a web access portal that your drunk uncle can connect to.\n\nNo. Yet again, I secretly hid my meaning by clearly stating it, which is that Uncle Ralph can't access it.\n\nJust outta curiosity, did you have a point? If 1 out of 12 issues don't apply to you, then ignore that one point. Were you waiting for my permission?", 1, "t1_g8w503c"], "g8wgbhx": ["&gt; How would two networks on same or similar channels cause more interference than a single larger network?\n\nI'm not sure what you're talking about.  I haven't mentioned a single larger network so I don't know why you're trying to compare them.  A network with more devices will have interference, but two networks that aren't talking to each other will have more, whether it be zigbee or wifi\n\n&gt; So you're saying that TP-Link put a \"number\" in the software in order to advertise that their router supports a limited number of devices, despite that it secretly has the same capacity as other models of routers that they make costing several times more? Odd that so many tech savvy people pay more for routers that are advertised as having better numbers. You have a source for cheap routers secretly hide unlimited capacity?\n\nIt's not a secret, it's in your DHCP settings.  Change the DHCP start range to \"2\" and the end to \"254\" and you've increased it to more addresses.  \n\n&gt; Similiar to TP-Link, I've secretly hidden what I meant behind the exact meaning of the words that I said, which is that you've missed you're calling as an official Hue hub installer.\n\nI'm beginning to think you don't have the faintest clue about networking...\n\n&gt; No. Yet again, I secretly hid my meaning by clearly stating it, which is that Uncle Ralph can't access it.\n\nWhat prevents him from accessing it and why is that different from wifi devices?  \n\n&gt; Just outta curiosity, did you have a point? If 1 out of 12 issues don't apply to you because of how wonderfully special you are, then ignore that one point. Were you waiting for my permission?\n\nYes, most of your points are nonsense.  Here are the valid points I see:\n\n- Mesh networking is helpful for some devices \n\n- Ease of use for people that aren't tech-savvy\n\n- Singular ecosystem makes it easier to work between brands.\n\nAll the other items are either wrong or show a misunderstanding of the protocol and the control system", 1, "t1_g8w6hhp"], "g8wjzyh": ["&gt; Because there is no coordinator between them to tell devices to back-off if one is getting overloaded. \n\nWhen does a network tell itself \"to back-off\"? That seems to address congestion rather than interference. How does a lack of being told to back-off result in more interference?\n\n&gt; They don't say that because the routers support more than 100 devices.\n\nYour ignorance isn't my problem. You've had ample opportunity to look it up yourself, and not once asked for a source, so it seems you are preferential to ignorance.\n\n&gt; But this applies just as much to other systems. For example, a lot of people use SmartThings as their hub so he could just as easily control everything with the SmartThings app. It's a problem that's unrelated to the wireless protocol\n\nThere is a standard well-known way to access the SmartThings app. It's called \"Google Play\". It is related to network protocol, and I explained why.\n\n&gt; There are a lot of parameters that cause interference including traffic, signal strength, location, and proximity to name a few.\n\nSo despite having just denied it, you now admit #1 and #2 is valid. As I said, an unsupported blanket denial of the other reasons don't mean much coming from such an unreliable source.", 1, "t1_g8wiy4y"], "g8wiuc7": ["&gt; There are many disagreements. You've answered most with misinformation (e.g. the static ip vs the internet nonsense and this about the support limit) and disadvantages that are in fact common to both approaches. It's not worth the trouble to argue.\n\nI addressed to ONE disagreement, which was that WiFi is able to handle more devices, by updating the post. \n\n&gt; The bottom line is that both can work, both are reliable, both have an open network API. \n\nWhat has an open API?\n\n&gt; Zigbee/zwave needs a hub and is generally more expensive, but has a commercially accepted device API (except for their early screwup). The mesh is good when it works but too opaque when it doesn't. \n\nI've already stated - REPEATEDLY - that WiFi also \"needs a hub\".\n\n&gt; Wifi is cheaper and more ubiquitous - most everyone already has wifi - but with no accepted device level API there's more opportunity for manufacturers to be bad actors. It's easier to figure out what's going on/wrong with a router vs zwave/zigbee.\n\nI've also addressed the issue of prices when comparing brand-to-brand. You seem to want to address DIY. Aside from being a narrow issue that's not relevant, DIY is lacking in ZigBee and Z-Wave. It's still not an entirely valid issue, since retasking existing sensors wouldn't be much more expensive, even if your time is worthless \n\n&gt; There's no clear winner, \"reasons to avoid\" is misleading. There's just pros/cons for each.\n\nI provided 12 reasons, none of which has anyone been able to dispute. Certainly ZigBee and Z-Wave have issues not mentioned - since the post is about wifi - but in general, WiFi is a clear loser for most people for most home automation.", 1, "t1_g8wfh77"], "g8x3kn9": ["You told me the features of the system you have, but if that's what you want me to believe....", 1, "t1_g8x3gcu"], "g8x3mq6": ["Right, SOME devices are routers, but most sensors and pretty much any battery powered device is not.", 1, "t1_g8wyicj"], "g8xa83o": ["&gt; I don't care about the latency, I care about cloud services not working/shutting down or internet failing.\n\nIf the internet fails, you'll probably have worse things to worry about than having to operate a garden hose.\n\nFor cloud services failing, you have to take it on a case-by-case basis, and to some extent roll the dice. Compare price versus likely gain. It's not like you're trying to build a system that outlasts you.\n\nRachio has been around for 5 years, so in this case, more rolling the dice than not. And the gain would be more efficient use of water and room to expand irrigation, neither of which you seem to care about, but all your call. Just letting you know about the sale.\n\n&gt; Still, that's designed for watering a lawn, not a garden and doesn't really fit my needs\n\nFair enough. Wasn't aware you don't use ordinary water on your garden.", 1, "t1_g8x5pgj"], "g8xeu13": ["&gt; If the internet fails, you'll probably have worse things to worry about than having to operate a garden hose.\n\nNot really, comcast goes down from time to time. I'd prefer my devices keep working.  Cloud services shut down all the time or they'll drop an API to make devices not work.  Even reputable companies.\n\n&gt; Fair enough. Wasn't aware you don't use ordinary water on your garden.\n\nWater is scarce sometimes so I have an extra source from a water barrel which I use before using tap water.", 1, "t1_g8xa83o"]}], "jflz4o": ["Beginner - How can i control smart plugs/led strips with single application\nHi all,\ni‘m a absolut beginner on this topic so sorry for my dump questions.\n\nWhat‘s my target:\nI have Gosund Smart Plugs and LED Wifi controllers here at the moment and control them with two seperated apps. I‘m searching for a future proof and cheap as possible (so no Hue or others) solution to control this with a single application which should by available on 2 Phones, later on probably also wall mounted tablets. I just want to switch on and of lights/plugs and change colour of the leds.\n \nI currently have set up a Raspberry Pi 4B 4GB with Open Media Vault as simple NAS for data storage. I also looked into openHAB which i could get installed on the same Pi via Docker, but i think thats a bit overkill and i‘m afraid that this would cause to much maintenance.\n\nSo is there a simple solution for my target?\n\nThanks ahead and have a nice day :)", "https://www.reddit.com/r/homeautomation/comments/jflz4o/beginner_how_can_i_control_smart_plugsled_strips/", 1, 10, "homeautomation", "security", {"g9l82ns": ["Your two current different manufacturers _will_ become more as time goes on and you get more devices, so now is the time to get your infrastructure in place to make that easier, otherwise you'll be juggling even more apps!\n\nopenHAB is a great home automation platform, and is what I've chosen, as all my device types are supported.\n\nTheir app works on both Android and iOS, and their Cloud offering is free, and gives you access inside and outside your home WiFi with the same app.\n\nYou can also connect it to Alexa and Google for further integrations and voice control, again free of charge.", 1, "t3_jflz4o"], "g9lutep": ["Here is my primer on HA tech\n\nTechnologies: Zwave, zigbee and insteon are \"full stack\" automation solutions. What that means is that communication layer, enrollment, encryption, API and device attributes are baked in. Every smart switch uses the \"switch\" profile and the command for \"light on\" is always the same. Zwave and zigbee allow for new, novel commands when new device types hit the market. They are not IP/wifi-based (they have their own network technology) .\n\nZwave, zigbee, and insteon use mesh radio networks. Low power, so battery friendly, and the mesh let's them have decent range. However only mains-powered devices can act as relays. Zwave is 900Mhz (good signal penetration for power but frequency varies by country), zigbee is 2.4Ghz (which can conflict with bluetooth and wifi b). Insteon is 900Mhz and also has powerline signaling as well in a dual-path configuration that is great in concrete block/steel housing that eats RF.\n\nCompare to wifi devices, which are wifi+tcp+ip+custom encryption+custom API+custom attributes. \"Wifi\" is just networking, there are several more components you need for device controls and they are very disparate. Even a \"standards\" based solution using MQTT as the API layer can have devices of the same type with radically different commands and attributes (lights on/off, power true/false, etc) or implement different encryption schemes. In zwave, zigbee, insteon the command for \"power on/off\" is clearly defined. Wifi also has security concerns as IoT devices have become prime targets for botnets.\n\nYes, ZWave, Zigbee, Insteon require hubs/controllers. Guess what? So do the wifi devices! They have a doodad (wifi access point) that connects to a phone/tablet/cloud. Surprise! Those are computers running a program to be the brain! Want a less pleasant surprise? A lot of the times (like &gt;80% of the time) that computer requires some cloud computer to be online. If there's any internet problems or the people running that cloud computer shut it down, your stuff stops working. Even less pleasant, you may need multiple clouds, meaning there are 2 or 3 different ways your gear can turn into doorstops. E.g. Using Alexa to control a Tuya bulb. Amazon has to be reachable for the echo to work and then they have to have the connector to the Tuya/SmartLife cloud AND your bulb has to be logged into the Tuya cloud. If Amazon decides to stop supporting Tuya, it breaks. If Tuya decides to shut down their system, it breaks. If your internet is down, it breaks. If Amazon's internet is down, it breaks. If Tuya's internet is down, it breaks.\n\nI prefer zwave for a couple reasons. First, Zwave mandates compliance and security testing. A handful of devices with implementation flaws have slipped through over the last 15 years and then the compliance test is updated to prevent that from happening again. With Zigbee that's optional. I also hearken from the bad old days where companies abused zigbee' custom configuration option and made ALL commands custom (I believe Xiaomi is still bad about this as they don't follow the officials zigbee spec). Zwave allows manufacturer specific commands but only when an existing command isn't appropriate, and it is enforced. Lastly, zwave has more 110v devices (switches, plugs, power strips), locks, thermostats and smoke/co detectors. There are various reasons but short answer is most retailers require110v devices/smoke detectors/locks/thermostats to have UL/ETL certification which is expensive and most zigbee device manufacturers are going for low cost/low overhead.\n\nZigbee is great if you want a lot of battery powered sensors on the cheap. The other thing it has a lot of is bulbs, due to Hue using the LightLink flavor of zigbee. It has been chosen by IKEA as their tech standard, which may be a plus. The last thing to remember for zigbee is that you need a Zigbee3 controller. Prior to Zigbee3 you either had a ZigbeeLL (lighting products) or a ZigbeeHA (locks, sensors, etc plus lights, but not the same commands as LL) and the two didn't talk. They still won't talk to each other, but Zigbee3 controllers will talk to both. Eventually all the old zigbee LL/HA devices will fade from the market but it will be a while.\n\nInsteon is sole source. Pretty gear, well made, all works together, but one supplier. I like options. But its like more Apple than Apple.\n\nControllers come in cloud-based and local processing flavors. What this means is a local processing controller will work without an internet-hosted service. SmartThings, for instance, loses most automations when their service is unavailable and you can't control the devices at all when that happens as the phone app connects to the ST cloud. (They are changing some of that but also abandoning their old software APIs so lots of ST functions are going to break) a controller where all the logic runs in your house will keep doing its thing even if the internet goes down, let alone a specific web service.\n\nIn the \"open box, start using it\" category, Homeseer, Hubitat and Apple Homekit are local systems. In the build-it-yourself category, HomeAssistant has the most vocal fan base followed by OpenHab. The other controllers I know of require some cloud services or they become either mindless zombies or doorstops. (Or are end-of-life and not worth buying right now, like Vera or alpha status like EzLo)\n\nUnless you are a tinkerer, I recommend using pre-built controllers. Home automation is complicated enough to get the automation logic working the way you want to also have to exert effort on getting the controller running.\n\nController wise, I use HomeSeer. They have been around for 20 years and make devices as well as controllers so they have a solid engineering core. It's a bit more expensive in some cases (like if you have 2 of each technology and don't standardize) but all HA is expensive so cheaping out on the brains seems stupid. Like \"hiring a teenager to drive your limo because you can pay them minimum wage\" stupid.\n\nI like HS because it is rock solid, worked out of the box, I have root access to the hardware so I can add other software if I want, and it meets my \"able to make backups and shift to other hardware\" requirement. They also have a deep product range, with cheap but powerful intro model based on a Pi3b and go up to x86 win10 appliances and can run on my hardware.\n\nHomeseer was my 3rd controller and I wanted something I could get up and running fast as I already had 3 dozen devices and a host of automations to recreate. Homeseer let me set up and migrate all the devices on a saturday and I got the automations figured out on sunday. Very high spousal approval factor (SAF). It plays nice with Alexa and Google.\n\nIf you really have your eye on Zigbee, Hubitat is a good choice. The system has zigbee and zwave radios built in and it supports a large number of zigbee devices. Iirc, xioami devices are supported by 3rd party drivers. But the hardware has less cpu power so it can get overwhelmed by large installs or complex automations. It too works with Google and Alexa.\n\nApple people will gravitate to homekit. Its not a bad choice but product selection is limited. Homekit is a special thing. Its a mix of wifi with custom APIs and bluetooth with custom APIs. Apple validates all of it so its solid and it is a local system, using an ipad or appletv as the hub. (I recommend the appletv just because you don't want to accidentally take your home controller on vacation or let its battery die.) But...its got apple fingerprints all over it but its dependent on 3rd party suppliers. Apple isn't great at having business partners so it is a little worrisome. Plus, you know, Apple walled garden.\n\nBut it works with Siri. And it's about the only thing that does work with Siri officially. There is a kind of backdoor using an app called HomeBridge, which uses Homekit developer APIs to let you connect some other controller (pretty much anything I have mentioned above) to Homekit. It works, it seems reliable but....any iOS update can close that backdoor.", 1, "t3_jflz4o"], "g9mwk51": ["Thanks for your reply but i dont want  to have a voice assistant, just a simple app.", 1, "t1_g9l4i34"], "g9n7pf2": ["A prebuilt controller would be a homeseer or hubitat, which has the radios and all software integrated.\n\nYour diy controller (pi + homeassistant) will need zwave and/or zigbee radios. There are combined devices (go control huzb1) that do both zigbee and zwave in one stick but you will need to make sure it plays nice with Hass. \n\nJust an FYI that as both are mesh networks, they work better as more devices are added as it gives more relays. Pick one if possible and stick with it, or plan on buying a couple 110v devices of each flavor to scatter around your house as signal boosters.", 1, "t1_g9mzb6j"], "g9q1xlk": ["Homeseer.com and hubitat.com normally, in non-covid times, have EU versions of their controllers.\n\nYou could look at Fibaro, its made in Germany. I dont know as much about it but I think its also a local controller. \n\nWith wifi devices you have to be careful. Like 98% of them need a cloud service. Let's say you buy one of the 50 rebranded Tuya devices. If your controller decides to turn it on, it sends a message to a cloud server in China, which then has to talk to your plug. \n\nNot sure if Kasa is available there. If so,, its a good choice for local. Maybe Shelley devices too.. may It take some steps to disable the cloud functionality, but there is a local API so your controller can run them over your wifi.", 1, "t1_g9nadyn"], "g9nadyn": ["Ah ok now i got it. Thank you very much for clarification, you helped me alot.   \nProbably i will than rather stick with a prebuilt controller, but i need to see how i can buy them here in germany. Can't find a supplier here that sells homeseer or hubitat.\n\nAnother question: What devices can i use without a zwave/zigbee radio? I think exclusively device which can be connected via wifi?", 1, "t1_g9n7pf2"], "g9x9ei8": ["So as far as i want to use wifi device - i will need to flash another firmware is that right?\nYes Kasa is availabel, there are some on amazon from TP-Link.", 1, "t1_g9q1xlk"], "g9l4i34": ["Alexa devices work great for this stuff.", 1, "t3_jflz4o"], "g9levuu": ["I agree with that first paragraph for sure. I've hit that point and my next smart device will probably be a zwave hub", 1, "t1_g9l82ns"], "g9mzb6j": ["&gt;Homeseer\n\nThank you very much for your detailed describtion. I will probably install HomeAssistant to my Pi and use this as \"Hub\".  For devices i will use  pre-built controllers like z-wave, zigbee ... Do you have a recommendation for good and cheap LED strips and plugs?", 1, "t1_g9lutep"]}], "jfnguk": ["Help shutting down old CPI system\n", "https://www.reddit.com/r/homeautomation/comments/jfnguk/help_shutting_down_old_cpi_system/", 1, 9, "homeautomation", "security", {"g9la5kv": ["Hi there, new home owner and not very experienced with these things.  I'm currently installing a new security system in the home (Ring).  I was exchanging one of the motion sensors, and I found the wires hooked up to it were still live.  I'm trying to figure out how to shut down the old security system (was previously CPI), but I'm not entirely sure how to go about that.  Theres an old CPI box in the closet, I assume the answer is somewhere in here.  Would appreciate any assistance.  Thanks!", 1, "t3_jfnguk"], "g9lhsg9": ["Former EOD Specialist here. Whatever you do, don’t cut the fucking green one!", 1, "t3_jfnguk"], "g9liwaq": ["In terms of shut down do you mean remove power from?  The best bet to do that would be to unhook the transformer for the system (that big metal guy above your box)  Make sure to turn off the breaker (and verify no power) before going near it cause you’ll be dealing with 110v, and cap/secure them before turning power back on.  Otherwise, the blue board is gonna be your next best bet.  Turn off power, unhook the leads from the battery itself, and unscrew/remove the AC+/AC- connections and cap/secure those as well before powering on.\n\nEdit: oops didn’t realize you already found the transformer :)", 1, "t1_g9liqv9"], "g9lyelp": ["That looks like the takeover of a wired system.  White box is a 2GIG TAKE345 wired-to-wireless bridge, so you're probably removing a 2GIG GC2 I'd guess.  Altronix board is probably a battery charger and DC power supply, supplying power to the motion and glass break sensors from the old system.\n\nWhy in the world would you want to take this out and replace it with that Ring garbage is beyond me.", 1, "t3_jfnguk"], "g9lbwc1": ["Unplug from the outlet and unplug the backup battery.", 1, "t1_g9la5kv"], "g9m0low": ["Whatever you do, do NOT cut the wires short. \n\nHaving a home wired for alarm is a selling point, and it’s a major pain to fix when someone cuts wires short. \n\nHonestly, if you are a DIYer- install a real alarm system. DSC is an industry leader. It integrates with home automation systems with eyezon. \n\nYou can get cheap central monitoring (and corresponding homeowners insurance discount) for cheap through Alarm Relay", 1, "t1_g9la5kv"], "g9liqv9": ["In terms of shut down do you mean remove power from?  The best bet to do that would be to unhook the transformer for the system (not sure if your system has an external transformer given it already has that internal blue power board). Typically there will be a wall mounted transformer in the garage, laundry room, attic ETC - usually about 1x2x2 inches.  Make sure to turn off the breaker (and verify no power) before going near it cause you’ll be dealing with 110v, and cap/secure them before turning power back on.  If you can’t locate that, the blue board is gonna be your next best bet.  Turn off power, unhook the leads from the battery itself, and unscrew/remove the AC+/AC- connections and cap/secure those as well before powering on.", 1, "t3_jfnguk"], "g9lwsel": ["So all that smp3 board is doing is power distribution. It takes an AC input from the wall plug, converts it to DC, charges the battery and spits out specific DC voltage.\n\nIf you want to cut power to the rest of the stuff, unplug the DC+ terminal, then unplug the battery completely, then unplug the wall plug.", 1, "t1_g9la5kv"], "g9t3x30": ["Thanks!\n\nFair concern.  Really just the cheaper monthly fees is why I went with Ring.", 1, "t1_g9lyelp"]}], "jenlq2": ["Reducing cloud dependencies (move to Home Assistant?)\nHey folks, I’ve automated a lot of my home for the past 4 years using SmartThings. With the discontinuation of the “Classic” app (and its features, reliability, etc) and upcoming discontinuations of the IDE, I want to move away from cloud dependency altogether. \n\nJust this last weekend I got HomeBridge up and running, and want to use the Home app on Apple stuff as my main controller now. I am an intermediate experience user.\n\nWhat should software I use as my new hub? I am expecting to use my Raspberry Pi 4 with a zwave and a zigbee stick to get my devices connected. Should I go with Home Assistant, OpenHab or something else?", "https://www.reddit.com/r/homeautomation/comments/jenlq2/reducing_cloud_dependencies_move_to_home_assistant/", 1, 8, "homeautomation", "security", {"g9fb1i7": ["If you have the time to do it then awesome, for the average person it may be a little much", 1, "t1_g9f9bsq"], "g9fo18j": ["See my reply to someone suggesting Hubitat [here](https://www.reddit.com/r/homeautomation/comments/jenlq2/reducing_cloud_dependencies_move_to_home_assistant/g9fnakp/?utm_source=reddit&amp;utm_medium=web2x&amp;context=3).\n\nAs far as OpenHAB vs Home Assistant. There's literally no \"pros\" to OpenHAB, just \"cons\". It ticks all the same boxes that Home Assistant has, but Home Assistant has easily 100x the userbase, 100x the developer base, a few times more things it integrates with, a nicer UI, and many other \"pros\" that OH doesn't have. OH is also Java and some wonky domain specific language for its codebase and config files, rather than Python and YAML. YAML isn't perfect, but it's a million times better than the thing that OH uses.\n\nI'd definitely not suggest OH over HA.", 1, "t3_jenlq2"], "g9fpkl5": ["I have had pretty good luck with the c5. Your points are valid and why I switched to home assistant. I wanted deeper automation. \n\nI set the hubitat up at my parents for some pretty simple reasons. I had it on hand as I was testing it before just going for home assistant. I am tech support and I don't need another house to tinker with when it is a long drive. They don't do anything complicated with it. The automations on it currently are sunrise and sunset lights and a motion activated light. \n\nI will always point people to home assistant but if all your doing is few simple automations hubitat has been fine", 1, "t1_g9fnakp"], "g9h2t4f": ["The new SmartThings app is working very well for me, after some initial problems.\n\nMuch processing is done locally. See [this article](https://support.smartthings.com/hc/en-us/articles/209979766-Local-processing). In particular, Smart Lights runs locally - that covers most of my automations. Cloud dependencies include virtual switches as well as obvious stuff like third party interfaces (Alexa, Google Assistant, etc.) and smartphone presence detection.\n\nSamsung has also stated that \"the current Cloud-based system for monitoring Hub-connected devices will be replaced with a new service that runs locally on SmartThings hubs.\"", 1, "t3_jenlq2"], "g9fqpe9": ["&gt; They don't do anything complicated with it. The automations on it currently are sunrise and sunset lights and a motion activated light.\n\n&gt; but if all your doing is few simple automations hubitat has been fine\n\nYeah, but for these examples a $3 plug in timer probably would work too... For stuff like this, it's definitely a decent choice, but the issue is recommending it 'generally'. For your parents, you know the use-case. You know they're not going to go out and buy a software defined radio dongle, fire up rtl_433 and try to collect temp and humidity data from 433MHz sensors via MQTT.\n\nRecommending it generally, for an unknown audience, I just can't truthfully say it's \"easier\" than HA. It's easier to unbox and plug in. It's easier to connect a few Zigbee bulbs to, and use the \"simple automation\" thing to do stuff like sunrise/sunset timers on them. But literally the second you go past this very very simple use-case it's no longer easier, and it doesn't at all take much to go from easier than HA to WAY harder. You shouldn't have to write Groovy just to connect a few simple MQTT things.\n\nI used to recommend it, hearing so many others say it's easier, but having actually owned one now, I definitely won't, unless I know the use-case is (and always will be) just very very simple things that it does out of the box.", 1, "t1_g9fpkl5"], "g9ffe91": ["I am a fan of home assistant. It does have a learning curve. Hubitat is another local alternative. I use it at my parents house. Most smartthings stuff will work directly with hubitat. That said I tinker way to much for hubitat and that is why I stick with home assistant", 1, "t3_jenlq2"], "g9f9bsq": ["I set it all up the first time, and because this is something of a hobby, I’ll enjoy tinkering more! The cloud dependencies on Samsung, Google and Ring in my current system are security holes I’d like to close! ¯\\\\\\_(ツ)\\_/¯", 1, "t1_g9f93bs"], "g9g6nfp": ["In the \"open box, start using it\" category, Homeseer, Hubitat and Apple Homekit are local systems. In the build-it-yourself category, HomeAssistant has the most vocal fan base followed by OpenHab. The other controllers I know of require some cloud services or they become either mindless zombies or doorstops. (Or are end-of-life and not worth buying right now, like Vera or alpha status like EzLo)\n\nUnless you are a tinkerer, I recommend using pre-built controllers. Home automation is complicated enough to get the automation logic working the way you want to also have to exert effort on getting the controller running.\n\nController wise, I use HomeSeer. A Hometroller Pi is $130. They have been around for 20 years and make devices as well as controllers so they have a solid engineering core. It's a bit more expensive in some cases (like if you have 2 of each technology and don't standardize) but all HA is expensive so cheaping out on the brains seems stupid. Like \"hiring a teenager to drive your limo because you can pay them minimum wage\" stupid.  I like HS because it is rock solid, worked out of the box, I have root access to the hardware so I can add other software if I want, and it meets my \"able to make backups and shift to other hardware\" requirement. They also have a deep product range, with cheap but powerful intro model based on a Pi3b and go up to x86 win10 appliances and can run on my hardware.\n\nHomeseer was my 3rd controller and I wanted something I could get up and running fast as I already had 3 dozen devices and a host of automations to recreate. Homeseer let me set up and migrate all the devices on a saturday and I got the automations figured out on sunday. Very high spousal approval factor (SAF). It plays nice with Alexa and Google.\n\nIf you really have your eye on Zigbee, Hubitat is a good choice. The system has zigbee and zwave radios built in and it supports a large number of zigbee devices. Iirc, xioami devices are supported by 3rd party drivers. But the hardware has less cpu power so it can get overwhelmed by large installs or complex automations. It too works with Google and Alexa.", 1, "t3_jenlq2"], "g9fnakp": ["Hubitat is faster and easier to get out of a box and plugged in. Past that, Home Assistant is WAY WAY WAY easier.\n\nWant a functional RGB color picker on Hubitat? Go get fucked, lol. The one built into the default web UI is absolute trash. The one built into the default dashboard is broken and requires you to select a color then hit the back button and NOT the \"x\" in the corner of the pop up menu, otherwise it'll revert your color changes. This has been broken for at least a year. Sharptools dashboard has a color picker that works, but it's cloud based.\n\nRule machine 4 is absolutely NOT even the littlest bit easier than Home Assistant automations. Simple automations are OK, but limited. Motion groups and button controller are both slightly easier than Home Assistant. Zwave on the C7 is just plain trash, but at least it's just a stinky dumpster of trash now, rather than the flaming dumpster fire it was a few months ago. Who knows when it'll be usable.\n\nWant to add some MQTT stuff? Good fucking luck, buddy. It's totally possible, and it works well enough, but you're writing Groovy device handlers for each MQTT device. There's a few \"general purpose\" MQTT apps that work similar to how Home Assistant does MQTT, but none of them work remotely what I'd consider \"well\". Buggy, laggy, etc. My custom Groovy device handlers for my MQTT stuff worked solidly, but they're at least 10x more difficult to create than tossing a bit of YAML in a file like on Home Assistant.\n\nI had high hopes of using a C7 along side Home Assistant, putting Zwave/Zigbee in the C7, along with stuff like motion groups and button controllers, but it's seriously borderline unusable.\n\nThere might be easier alternatives to Home Assistant, but having owned a C7 (that's sitting unplugged in its box right now), I can't at all recommend it. Especially not as a \"less difficult than Home Assistant\" alternative, as it's just absolutely not.", 1, "t1_g9ffe91"], "g9f93bs": ["Sounds like a pain in the ass to move from something that was already setup for you &amp; have to set even more stuff up all over again lol 😂", 1, "t3_jenlq2"]}], "jffih6": ["Current HA tech almost makes me miss X10\nI've been in the HA game *a long* time -- just shy of 25 years. Back in the day if didn't want to break the bank X10 was about all there was. Sure it had it's share of quirks, but these were knows quirks (anyone remember the hack to jump the two hot legs?) and there generally ways around them. And once it was dialed in it worked *most* of the time. \n\nMy current hardware is Hue, Hubitat (just replaced ST), Zooz outlets &amp; smartplugs, schlage locks, and GE ZWave switches. Nothing exactly earth-shattering.  And yet if there's one consistency, it's the lack of consistency.   GE switches -- I love them when they work but about 15% just don't out of the box.  I'm thankful for Amazon's return policy. The zooz smart plugs work most of the time, and then they just dont. So I take them near the hub, factory rest and repair and they work for a while. And dont even think about taking them more then 25' from the hub.  The schlage lock was an absolute bitch to get to work. Had to rub it's nasty bits directly on the hub for initial pairing. Every time I change batteries I fear I'll have to do the same thing which isn't exactly convenient.  Of all components, the Hue lights have been the best. And don't get me started with integrating Google Home -- what a half-assed piece of crap.  Much of the time it works, but then it doesn't.  Not much different than most Google stuff.\n\nSure, my longing for the simpler X10 days is a bit /s, but there's and element of truth to it.  OK, rant mode off.", "https://www.reddit.com/r/homeautomation/comments/jffih6/current_ha_tech_almost_makes_me_miss_x10/", 1, 41, "homeautomation", "security", {"g9k83vf": ["I have a vera plus hub with 32 devices. 4K sq ft home no issues with any of them. Better than my old x10 stuff any day.", 1, "t3_jffih6"], "g9kc093": ["Personally the GE switches, that is exactly why I went lutron when I moved.  So far lutron is the most stable switch system I've ever used.", 1, "t3_jffih6"], "g9khv1a": ["Amen. x10 was so annoyingly flaky, and susceptible to interference… not to mention all the stuff you can integrate nowadays. I certainly don't pine for those days.\n\nI'm in the process of moving to home assistant/node red, from my Vera, but the Vera is/was very stable. I'm only doing it for the rules/automation side of things really.", 1, "t1_g9k83vf"], "g9kks15": ["As unlikely as that might be, I'm almost always at home when the blanket turns on, and if not,  I can turn off the blanket with the Alexa app on my phone at any time. \n\nAnd when I get up, it automatically cuts off.  Saves me from having to remember.", 1, "t1_g9kgge9"], "g9kmmqy": ["Exactly why you would want the ability to automatically turn it on and off rather than leaving it on all the time", 1, "t1_g9kgge9"], "g9l636u": ["It’s called Insteon!", 1, "t3_jffih6"], "g9nxfa6": ["Hey, you asked \"Why?\".", 1, "t1_g9nwkgg"], "g9lrjc6": ["I've been doing this for about 5 years at different houses. I used GE Zwave switches and dimmers on my first setup, then I used Homeseer Dimmers, and now all I use is Inovelli for dimmers and switches. I've had probably 5 ge switches die over 5 years, the dimmers have been alright, Though. I've had 4 Homeseer Dimmers die in 2 years, but now if either dies it gets replaced with an Inovelli dimmer or on/off switch. I've been using Inovelli for about 6 months, and I'm very happy with them...I gotta say they're probably the best zwave switches. Check em out. \n\nIn terms of Zwave network reliability, it's been pretty solid. I have 2 ge on off switches that leave the network probably once every 2 years, but that's not too big of a deal. Schlage Zwave lock has no problems, I paired it once and that's been it. Im on a smart things gen 2 hub..I've used gen 3 and that seems fine too. The idea that every Zwave device extending the network works, I have a couple of devices probably 50' away from the hub, if it went straight to the hub it would have to go through a couple brick walls..but my other switches seem to be extending the network no problem.\n\nI'd say see what a Zwave network repair does, and worst case exclude all the devices and repair, starting with the device's closest to the hub and then branching out, followed by a network repair. Just my 2¢", 1, "t3_jffih6"], "g9lpdhl": ["Which is exactly why I switched to OpenHAB. Yeah, I have to set everything up myself, but I've never experienced an outage where I couldn't control my devices... Except when the power went out. At which point, who cares?", 1, "t1_g9k0ky4"], "g9m1lrm": ["My Insteon dimmers and sensors work well. Zwave is a bigger PITA when the hub fails.", 1, "t3_jffih6"], "g9kvtgf": ["Between Z-Wave and Zigbee, Z-Wave is a no-brainer for me, with Zigbee being a steaming pile that interferes way too much with WiFi.  I have zero issues with my GE/Jasco and Zooz devices; however, my hub is SmartThings which may be part of the difference.  I also have pretty thorough coverage in my network with no device more than about 20' from another device and most less.  I did have to get one Z-Wave repeater to achieve that.\n\nOf course, I have other tech, including WiFi, MyQ, etc. and my central control is Home Assistant.\n\nMy only complaint about home automation tech is the fact that the vendors keep changing their standards.  I'd love to stay at one version of Home Assistant; however, gateway services change frequently or just outright go away.\n\nAutomation is definitely not for the faint of heart.", 1, "t3_jffih6"], "g9n0j7f": ["Funny, you're describing \"simple\" to me. When I think complex, I think of all those people using proximity sensors and trying to program fuzzy logic or quasi AI into their routines, you know, in order to make their smart homes \"smart.\"\n\nI decommission a Mac mini this year, so I've transitioned from the awesome stability that is Indigo to HA myself, because it runs on my NAS unobtrusively. Most of my light switches are Insteon, although I have a few Inovelli's just to fill in the Z-Wave network, because I have a couple of Z-Wave power outlets that I want to use, mostly at Christmas time.\n\nI don't use any of Insteon's cloud-based crap; only the PLM's (including a spare!). Z-Wave on serial, but also an AD2USB to include my non-monitored Honeywell alarm system into the fold, plus the assorted Hue where I want color.\n\nUsing expanded alarm zones, I've got an Insteon door switch (radio only) configured as an alarm panel zone, and now that I think of it, two Inovelli ambient sensors in the alarm panel, too.\n\nMy house has a bunch of switched outlets instead of overhead lights, so anywhere I have Hue, I hardwired the power to the outlet, and installed the Insteon as a switch only. (There was no Inovelli then.) This lets me control the Hue via HA. And since I don't believe in having tablets and control panels or being tied to a phone, I take advantage of fast-on/fast-off in HA, as well as repeated clicks to get different behaviors. Repeatedly using slow-on, for example, will advance the Hue themes, or fast-on (double-click) the mudroom will _also_ illuminate most of the first floor in addition to the normal mud room load.\n\nMaybe I'm too modest when I say I keep things simple, but to me, it's simple when the alarm panel is an alarm panel, light switches are light switches (with extra features), and you don't _have_ to use a phone or tablet to do simple things.\n\nThe one concession to the cloud I make is voice, but I do is all via HA instead of vendor-specific solutions. They still need internet access, but I can very finely tune what Siri and Alexa respond to, rather than allow any random vendor-generated crap. This is all \"bonus\" though; nothing I have depends on voice.", 1, "t1_g9lv2eu"], "g9k0ky4": ["Yes, once monetization of hardware alone became near-impossible everyone switched to either cloud dependence, subscriptions, or some combination of both.", 1, "t3_jffih6"], "g9l6f5c": ["The hack was turning on your 220 VAC dryer or wall oven, or installing a capacitor across the two hots.\n\nMy X10 switches broke down all the time, and the limited house codes meant it was kind of a PITA to get really fancy. You could, but it was a PITA. Since moving, I'm pretty sold on Insteon. It's a shame that they don't really push their products more, or open up to other licensees, because Insteon is pretty freaking great. And because of its history, you can still set house and device codes and treat a lot of them like X10.\n\nThey use both radio and powerline communication, and because of that, they can bridge across the center tap without installing a capacitor (they use the radio).\n\nI have a few Z-Wave devices, but they're finicky, probably because I only have a few, and they don't have any powerline communication; they're radio only.\n\nOverall, I keep things simple. My automations are time-based and activity-based. I don't mess with locks. I do have my security system integrated. I'm pretty happy with the current state.", 1, "t3_jffih6"], "g9lascm": ["I tell you, my zwave network and homeassistant setup has been rock solid. The only hard part is keeping up with all the changes in homeassistant and anything using a cloud API. But the zwave network, rock solid (as long as I change the batteries).", 1, "t3_jffih6"], "g9le98j": ["zwave and hassio and its consistant. Except when an update breaks everything. But its been a while since that happened.", 1, "t3_jffih6"], "g9lezm9": ["I actually had some X10 stuff, ran it off my Macintosh SE (f$%k I'm old), which is why now if it doesn't have an ESP8266 module in it I don't buy it, can flash it to work offline, runs off my regular wifi, no hubs, no cloud crap, and works fine with most HA software", 1, "t3_jffih6"], "g9kgge9": ["I thought about doing that exact automation until I read up on how frequently electric blankets start fires...", 1, "t1_g9jwuy9"], "g9l04ba": ["Do your research and find out what works for you. Some people are thrilled they have something automated but just accept it's flaky sometimes. \n\nI want reliability above all else, so I stick with certain tried and true brands like Lutron for things. I don't want random IP based devices that multicast all over my network to try and discover each other (WEMO). Mesh based networks like Z-Wave simply don't work for me (could be my house construction, interference nearby etc).\n\nIt can be reliable as you want if that's what you prioritize.", 1, "t3_jffih6"], "g9llid2": ["I have mostly had the opposite experience so far although I am relatively new to HA. I think a lot of it comes from the fact that most of my stuff so far is switches, plugs and bulbs that are WiFi and Tasmota flashed so that they are strictly local only. These things are basically set and forget, even after a power outage and obviously if internet goes out they do not care one bit. \n\nI've just gotten into Zigbee with some zigbee USB sticks added to my HA Pi's and the biggest trouble I've had so far is initial pairing; sometimes it works sometimes it doesn't but once they are paired they generally work.", 1, "t3_jffih6"], "g9lp4e4": ["I dunno... My Z-Wave network had been rock solid, apart from one or two problems. One was a single idiot bulb that resets when the power flickers and turns on at 4am if it loses power at all... I replaced it, so no worries there. Smart bulbs are dumb, lesson learned. The only other trouble I've had was when devices were unplugged or moved, and the network hadn't healed yet.\n\nI haven't had any dead switches, except one that was fried with extreme prejudice in a storm; I have three zooz plugs, and they work just fine, even a decent distance away (about 20', through three walls and a floor).\n\nIntegrating Google Assistant was a bit of a pain, but it works at least 90% of the time.\n\nGranted, it took a bit of work to get this far; I started with Vivint, moved to Wink, and finally ended on OpenHAB, which has worked beautifully, now that I've got it set up. I wonder if it's your hub that's the problem?", 1, "t3_jffih6"], "g9lrnjz": ["In my side of things. I've found wifi switches to be amazing. Very very stable is amazing. I never have problems with them except I messed something and my MQTT servers is down. Everything I run is local it's been great. I chose wifi for the price and the alternatives to run everything local with tasmota. And couldn't be happier.\n\nI of course invested in good wifi. Two unifi access points for a total of 300 dolars. And my family loves how good is the wifi. And my smart devices never have problems because of it. Tons of people I've seen talking down in wifi for smart home but my 7 month experience couldn't be better. \n\nI have zigbee buttons, door sensors and motion. At the beginning was hit and miss with the ZSA integration. But now days it's solid.", 1, "t3_jffih6"], "g9jvj2g": ["Agreed.", 1, "t3_jffih6"], "g9k6gcr": ["Near identical post last week (nothing wrong with it).\n\nIt's not great, you need to make purchases that let you carefully avoid the pitfalls. Get hackable/flashable devices, independent zigbee hub and devices whenever possible. Assume every company will go bankrupt tomorrow and with it, their supporting services. Purchase accordingly, and consider costs of cheaper devices with that in mind versus mode robust, proven tech (eg. Lutron Caseta vs. some other brands)", 1, "t3_jffih6"], "g9ncirn": ["&gt;Do you use X10 stuff still? \n\nAlas, I do not. I too have a rather large box of bits &amp; bobs in the garage I just cant bring myself to get rid of... nostalgia and all that!", 1, "t1_g9lpq3f"]}], "jg2xuz": ["New house , buying a Yale Lock - WiFi or Z-Wave?\nI'm about to get buried in the rabbit hole of home-automation. But I need to change my locks asap on new house.\n\nWhats the TLDR best method on setting all of this up to be future-proof. Wifi and bluetooth enabled version of the Yale or stick with Z-Wave? I am an iOS user, plan to use Alexa however in the future.", "https://www.reddit.com/r/homeautomation/comments/jg2xuz/new_house_buying_a_yale_lock_wifi_or_zwave/", 1, 7, "homeautomation", "security", {"g9o4dqr": ["nice. I thought so. Z-Wave it is!", 1, "t1_g9o2k45"], "g9ny00n": ["thanks! so really what is the main difference between their wifi + bluetooth version and the z-wave version? If wifi goes down, I imagine you're out of luck for opening door remotely on the wifi version?", 1, "t1_g9nxs4b"], "g9nxs4b": ["Personally I would and did go with zwave. While I have had issues with it at times my yale zwave lock has been great, batts last about a year and it has been rock solid. The only thing I wish it had was more access to the API for custom automations but that's more of an industry issue then yale. Wifi seems to work great so long as you only have a few devices (20 or less) but in my experience starts having a negative impact when the waves become too congested.\n\nTake some more time, read a bunch and welcome to the club.", 1, "t3_jg2xuz"], "g9o4rng": ["Zwave over Wifi   \nthe batteries last longer. \n\nZwave uses a lower frequency radio .. which also means lower bandwidth, but who cares when it's basic commands that are getting broadcast. Then you also don't need to go down the rabbit hole of having a separate IoT WiFi network which is recommended for security.", 1, "t3_jg2xuz"], "g9p5i7k": ["Personally, Zigbee &gt; WiFi &gt; Zwave.\n\nI don't trust that ZWave will still be around in 5 years, and I don't want to buy into a doomed ecosystem.", 1, "t3_jg2xuz"], "g9o2k45": ["Zwave every single time.  You don’t want to start your journey by getting a bunch of WiFi devices all with their own apps and closed APIs, making it tedious to integrate everything...it can be very frustrating.", 1, "t3_jg2xuz"], "g9o700v": ["Helps a lot. Thank you so much. I'll be doing Z-Wave and potentially a Smartthings hub to control everything.", 1, "t1_g9o4rng"]}], "jgthng": ["I Need help choosing a doorbell security system to use\n \n\nI live in Florida in a gated community that is nice on the inside but a mile or 2 so down the road it gets a little sketchy. We have had issues with people sneaking into the community pool, trying to get into cars, taking Amazon packages etc.\n\nThere's so many options that I have no clue where to start. Quality of the video feed is important to me. Having cell phone alerts as well. Not sure what other features would be necessary to determine what product fits my needs best.\n\nI uploaded a picture of the front of my house and labeled where I think the cameras should go. Would the doorbell be a camera or a smart doorbell? Then above the garage would just be a camera? Are those two spots my best options?\n\nI would rather use a wired connection instead of wifi but I have no clue how I would get an ethernet cable to these spots??? I would assume installation cant be too difficult. So I am looking for some advice and suggestion on what system to use and placement, etc etc", "https://www.reddit.com/r/homeautomation/comments/jgthng/i_need_help_choosing_a_doorbell_security_system/", 1, 15, "homeautomation", "security", {"g9td8u5": ["I can very much recommend Eufy. I really don't want to pay for (and have all my video stored in the) cloud. I want control over what's saved and what not, Eufy does just that. \n\nThe video is on par or superior to Nest/Ring (I have friends who have either, so have seen comparison). It's easily set up and configurable. Because you can use repeaters/home stations, it's not too difficult to get a stable connection (at least for me).\n\nYou can wire it to an existing or new trafo as well, so no need to replace batteries.\n\nThey also sell separate camera's which connect to the same home station, so you've got an all in one package too.", 1, "t3_jgthng"], "g9tlzqs": ["Do the wyze cameras work with nest", 1, "t1_g9skezd"], "g9scqjv": ["Cloud is probably a definite necessity right?", 1, "t1_g9scfxu"], "g9scfxu": ["I just installed the Ring cameras around my house and it’s amazing. Only one downside is you need to pay for year 100$ for cloud service", 1, "t3_jgthng"], "g9x5y18": ["Work with nest as in the same app? They're 2 different systems and 2 different apps", 1, "t1_g9tlzqs"], "g9sh2jo": ["Look into unify. It's a tiny bit more up front because you need the cameras, potentially a poe switch, and the NVR. But you won't have a monthly subscription, you can access the videos from online, and everything is stored locally on your network.", 1, "t3_jgthng"], "g9spubz": ["They have a wireless camera now and have announced a second. They can be powered the old fashioned way or with poe but the data is all wifi. The doorbell is wireless as well. It uses the existing transformer for power.\n\nThe big selling point is its doesn't require a subscription and all the video storage is local. So 24/7 recording accessibile from wherever I want.", 1, "t1_g9skrm6"], "g9skezd": ["If you are going to pay for a cloud service, IMO, Google's Nest is the best for picture and has a fantastic app with facial recognition.\n\nEufy is a decent somewhat \"non\" cloud based alternative\n\nIf you have some tech skills and the budget, Ubiquiti is great.\n\nIf you like to tinker, Wyze outdoor cam and the upcoming doorbell could be a good affordable option.\n\nFor my home I use the nest doorbell and then indoor wyzecams on the outside (under an overhang they work just fine). It's cheap and gets the job done with 24x7 recording (power required)\n\n&amp;#x200B;\n\nHow I would do it based on that picture: Nest doorball camera. You can subscribe to the cloud service if you want facial recognition and more video retention. It isn't required. \n\nThen I would put 2 wyzecams up on each corner of that garage under the overange ($25 each, plus a 32gb microsd card and a 10 foot USB extension power cable to power them). That way you aren't dicking around with batteries and have **24x7** recording. For me, 24x7 uninterrupted recording is worth it. If you have any sort of security system that doesn't do 24x7 recording... it isn't really a security system. Additionally you can put another wyze indoor camera under the overhang of your doorway pointing to the right if you want even more coverage.", 1, "t3_jgthng"], "g9svwyp": ["Yes, whether you go with Ring or something else, they can all be pulled up with a mobile app!", 1, "t1_g9sgir3"], "g9smbr4": ["How handy are out? Is cost a concern? Does it have to be exterior?\n\nI am a big fan of Nest cameras. Great quality, subscription cost does not change with additional cameras, and always on (vs. motion activated).\n\nHowever, the exterior models are pricey. And you need a power source. I had exterior outlets installed near where I mounted my exterior cameras to keep things clean.\n\nFor locations near a window, I use an interior Nest cam. Cheaper but quality will be degraded by window glass.", 1, "t3_jgthng"], "g9skrm6": ["Ubiquiti is great but you'll have to work out the wired ethernet connections first, 8 port PoE switch, and the NVR. If i could do my house over again I would have done this and ran the ethernet when the house was built. I went the cheaper wifi route which has worked just fine", 1, "t1_g9sh2jo"], "g9sg2xg": ["As far as my doorbell, I have the Ring Elite, which is POE, so I did have to run a network cable to that location!\n\nRing also makes a Floodlight Cam for above the garage, but it would be wireless: [https://shop.ring.com/products/floodlight-cam](https://shop.ring.com/products/floodlight-cam)\n\nAs far as any other locations, you might look in to getting a security camera system (POE), 4K! It will record to a local DVR and you can pull them up and monitor them at any time!", 1, "t3_jgthng"], "g9sgir3": ["Pull them up via a mobile app?", 1, "t1_g9sg2xg"], "g9schqn": ["Same thing has been happening in our neighborhood with people taking packages. I have been looking for something without a subscription service like Eufy or an older Arlo, but both run over Wifi.", 1, "t3_jgthng"], "g9uinlu": ["Absolutely yes. Now I’m able to see any event happening on camera. I would definitely recommend it. Plus it is very flexible with settings plus quality of video will give you legit opportunity to prove anything happening on your property(talking from personal experience. Dm me for more details, if you need. )", 1, "t1_g9scqjv"]}], "jfjwvu": ["Kohler DTV Shower Valve\nMy master shower failed and now it's time for a full on gut/remodel of the entire space.\n\nhttps://i.imgur.com/TbCzzxL.jpg\n\nThe shower will be a Schluter Kerdi install 72' x 62' with a slot drain at the wall and two shower stations.\n\nShower station 1 will have three water jets and a ceiling rain tile\n\nShower station 2 will have three water jets, a ceiling rain tile and a hand shower.\n\nIs the protocol for the DTV system accessible/available?   Is the communication between the controller and the shower valve (RJ11) RS232 (which I can reverse engineer).\n\nI have extensively automated my house and use Command Fusion as the controlling app.   I have a Moxa NPORT for RS232 to  lan communication, Binary MOIP a/v matrix, RadioRa2 lighting and HVAC, Luma camera system and DSC security system all integrated into the app I created.\n\nI'm hoping that the RJ11 connection between the Kohler components is RS232 and that I can connect it to my Moxa.", "https://www.reddit.com/r/homeautomation/comments/jfjwvu/kohler_dtv_shower_valve/", 1, 8, "homeautomation", "security", {"g9le92t": ["The valve is remote and would be installed in an accessible location", 1, "t1_g9ldz52"], "g9ky4xh": ["Yes, it's accessible but not easy to work with existing libs. I'd love some help maintaining [https://github.com/niemyjski/homeassistant-kohler](https://github.com/niemyjski/homeassistant-kohler) and [https://github.com/niemyjski/kohler-python](https://github.com/niemyjski/kohler-python) but it's working with my setup :)", 1, "t3_jfjwvu"], "g9s2bx6": ["I’ll just write my own library", 1, "t1_g9r6cbf"], "g9ldz52": ["Honestly I would not put technology behind a tiled surface. When it stops working it will be very expensive to fix and it will stop working.", 1, "t3_jfjwvu"], "g9sgfxn": ["Or you could help make one good library?", 1, "t1_g9s2bx6"], "g9tkycc": ["I would be doing a JavaScript module for CommqndFusion", 1, "t1_g9sgfxn"], "g9r6cbf": ["The protocol is not public.... Yeah, they have a managed switch (controller) that you can talk to but hardly any libraries work with it (over http) because they return invalid http headers which messes with a lot of libraries. That's why I have the crazy hack that I have.", 1, "t1_g9lec3q"], "g9lec3q": ["Is t RS232?  Is the protocol public or did you reverse engineer it?\n\n*edit* I just glanced at your python.  The Kohler has an internal http server using json?", 1, "t1_g9ky4xh"]}], "jfndje": ["Help turning off power to old security system\nHi there, new home owner and not very experienced with these things.  I'm currently installing a new security system in the home (Ring).  I was exchanging one of the motion sensors, and I found the wires hooked up to it were still live.  I'm trying to figure out how to shut down the old security system (was previously CPI), but I'm not entirely sure how to go about that.  Theres an old CPI box in the closet, I assume the answer is somewhere in here.  Would appreciate any assistance.  Thanks!", "https://www.reddit.com/r/homeautomation/comments/jfndje/help_turning_off_power_to_old_security_system/", 1, 4, "homeautomation", "security", {"g9lc8cn": ["Yes", 1, "t1_g9laawa"], "g9l9vmw": ["Two things will shut it off:\n\n(1) Disconnect the backup battery\n\n(2) Find the power plug and unplug it", 1, "t3_jfndje"], "g9laawa": ["dumb question.  Safe to just disconnect the leads right off the battery without turning power off to it?", 1, "t1_g9l9vmw"], "g9lgjt1": ["Yes, you will be fine!", 1, "t1_g9laawa"]}], "jg4lza": ["Looking to make existing home security system a little smarter\nHello, recently moved into a new place that already has one of those DSC panels with some sensors around the house and on the windows. We currently aren't subscribed to any services but I'm looking for something that I can retrofit onto this panel to give me alerts or allows me to alarm/disarm from my phone. What's out there now? \n\nThanks in advance!", "https://www.reddit.com/r/homeautomation/comments/jg4lza/looking_to_make_existing_home_security_system_a/", 1, 10, "homeautomation", "security", {"g9o5miw": ["Yea that'd be ideal\n\nBeing able to alarm/disarm on keypad and phone", 1, "t1_g9o5fmp"], "g9o5ddj": ["I'll look into this thanks", 1, "t1_g9o522g"], "g9o5w1t": ["Look at the Konnected INTERFACE kit, or Hub6 Safe. Hub6 is more flashy and easy to install, but is cloud based and relatively new. I haven’t installed the interface kit yet, but there are plenty of videos on how to install it. It connects to smart things for actions and commands.", 1, "t1_g9o5miw"], "g9o5ccq": ["I believe wired, they look like [this](https://i.imgur.com/KNrNn3C.jpg)", 1, "t1_g9o4e56"], "g9o5fmp": ["Do you want to maintain keypad usage?", 1, "t1_g9o5ccq"], "g9o7jx0": ["No I haven’t. They are based out of Canada, and I’m not sure about shipping. Check on the r/homesecurity to see what others think.", 1, "t1_g9o78e2"], "g9o4e56": ["Are all the sensors wired or wireless?", 1, "t3_jg4lza"], "g9o7na0": ["thanks\n\ni happen to be in Canada so that works lol", 1, "t1_g9o7jx0"], "g9o522g": ["I’ve been looking into this as well and thinking of getting something like the envisalink. \n\nThis  guys blog goes through a bit. https://chrisschuld.com/2019/02/home-assistant-to-dsc-alarm-with-an-it-100/\n\nEdit: Typo", 1, "t3_jg4lza"], "g9o78e2": ["alright! the Konnected looks like a fun little project \n\ni'm not super worried about the whole cloud based thing, just more interested in convenience hehe, have you had experience with the Hub6?", 1, "t1_g9o5w1t"]}]},
{"jep8um": ["Eufy died.. need something to replace it\nLast year I picked up a Eufy 11+ refurb for $100. We've never had a robot prior and figured for $100, wth. My wife loved it. Now a little over a year later it's dead. \n\nDead means: One of the motors has some sort of short or otherwise damage so the wheels don't spin as freely as they used to. I've opened it up and watched some repair videos. I'm not willing to disassemble the motor itself and mess with the windings to get this $100 thing to work again.\n\nThat being said, I'd like our next purchase to last more than 16 months. \n\nI've seen Eufy is recommended as a high value brand, but with the number of repair videos I found and the fact that I opened it up 2-3 times for various issues: Front Bumper stuck, Dirty sensor, Wheel motor issue I'm not sure I can agree.\n\nBudget is sub $400. Eufy again? Roborock? iRobot? \n\nFirst floor is tile/hardwood with low pile area rugs without frilly edges or anything. We have a no shed dog. We have toys. We are a google and home assistant household. \\~1700 sqft to be covered\n\nTIA", "https://www.reddit.com/r/homeautomation/comments/jep8um/eufy_died_need_something_to_replace_it/", 1, 12, "homeautomation", "trust", {"g9fq84e": ["I had an iRobot (non-WiFi) for almost three years. It was easy to fix things that went wrong (like replace the brushes) and quite durable. Then one day it got stuck on a yoga mat and a wheel got totally destroyed and it couldn’t propel itself anymore. A new wheel was like $80 and I kind of just wanted a new vacuum, a smart one. I got one on prime day for $284-\n\nI’ve had the Roborock S4 for like a week now, so I can’t speak to the durability. I have pros and cons.\n\nPros: \n\nit uses Lidar to map your home and cleans systematically instead of bumping around at random like my iRobot did. \n\nI can set “no-go” zones- I set one where I like to keep my yoga mat and now I don’t have to worry about the robot getting stuck if I leave it out.\n\nI can schedule it to only clean certain rooms.\n\nI can set it to “quiet” “balanced” “turbo” or “max” - my iRobot was kind of loud.\n\nIt’s smarter around obstacles.\n\nI can remote control it from the phone with a joy stick (used this to get a specific pile of dirt)\n\nSo far it hasn’t trapped itself by closing doors (because it doesn’t bump around at random)\n\nIt works well, it’s picking up a big amount of dust and dirt every day. I don’t know where it comes from.\n\nCons:\n\nThe lidar sensor makes it a little taller and there are a couple pieces of furniture it won’t go under. But I put my couch on like 1/4 inch risers and that was enough, now it goes under that.\n\nIt thinks my bed skirt is a wall so it won’t clean under the bed unless I tuck the bed skirt up out of the way\n\nI hear it making a flapping noise like something is caught but I can’t find anything wrong with it\n\nThe Alexa functionality is lame\n\nIt gets caught up in a weird way around a certain rug and has a lot of difficulty with my door thresholds which are maybe half an inch tall, IRobot didn’t have this problem. When it gets stuck it rubs the wheels on the ground making a loud rubbing noise which I hate because it probably disturbs my downstairs neighbors\n\nAnd finally it’s only good for hardwood or low-pile rugs which is fine for me that’s all I have, but good to know.\n\n\nIf I had the choice to make again, I would probably reconsider other options. But I’m happy enough with it.", 1, "t3_jep8um"], "g9g0n02": ["The no go would be key for xmas tree time and some pieces of furniture we have that the robots can go under but also stuck. Yea.. I found my eufy more than a few times someplace that I couldn't get it out of easily haha", 1, "t1_g9fuly2"], "g9fs0nn": ["No, but I have no pets and it's just me so the clean base seemed like overkill for me.  In your case it might make sense but you can always buy it separately later on if you see the use case.  I usually go about four missions or so before emptying the on board and cleaning the filter.  I bought a Eufy hand vac to get the corners or for quick clean ups and between the two my floors are spotless.\n\nI'm hoping to try out the roomba floor mop (Braava) at some point; I like how the i3 and the Braava work together.  I'm hesitant to trust both tasks to one bot though.  They're two very different tasks and it's hard for me to believe one robot can be designed to do both well.", 1, "t1_g9fqpkt"], "g9g3fue": ["Eufy 25c for $99 11/4 is it a trap?? Not saying it's a great one but will a $400 get me 5 years or should I rent these for $100/yr", 1, "t3_jep8um"], "g9fvrjp": ["For what it’s worth my parents have had an Eufy vacuum (the 11S IIRC) for three or four years now and haven’t had any issues with the robot itself. Still runs as well as it did on day one, though it’s due for a battery replacement.\n\nI think you’re probably seeing so many repair videos precisely *because* they’re beloved devices that are comparatively easy to repair.", 1, "t3_jep8um"], "g9fuly2": ["You can get a virtual wall for it, but to be honest this was the first bot I let have run of the house.  It's only gotten stuck twice and both cases it was my own fault (one for instance was when I left the sliding door open to the enclosed rear porch because I forgot).  It's got 'cliff sensors' so it's not going to take a dive down the stairs or anything.", 1, "t1_g9fu3ld"], "g9fqpkt": ["Just had a look, it looks pretty nice. Do you use the the self empty canister add on? I just watched some more videos and I'm torn between mopping like S5 Max and self empty.\n\nI don't think any robot vac can keep up with the 1000 sq ft of mopping haha.. but maybe even if just the kitchen that would impress my wife.", 1, "t1_g9fp0z7"], "g9fp0z7": ["Love my new Roomba i3.  It replaced two other bots I had in separate areas with virtual walls because they couldn't be completely trusted to carry out missions beyond their areas.\n\nThe i3 now does the entire first floor, all rooms.  No problems with my high thresholds, no getting stuck.  Great job cleaning to the point where I don't even mind walking around barefoot or in socks.  Mine is integrated with HomeAssistant so I can log data, start missions, get maintenance reminders and even see a map of where it cleaned after it's done.  Also integrated with Google Assistant and Alexa to the point where I just say the wakeword (for the platform) and then say \"Vacuum the house\".\n\nThey've really done a fine job with the programming internally. It's impressive to watch it go to work; it really feels like it's moving with a purpose, with intelligence.  Cleans only the rooms that need it and can even go back to base, recharge and then pick up right where it left off.\n\nCan't recommend it highly enough.", 1, "t3_jep8um"], "g9fu3ld": ["Does the i3 have no go markers?", 1, "t1_g9ft64b"], "g9fsc9q": ["Yea, I agree with the dual purpose. I wasn't really looking on Prime day and missed some of the deals, but I'm hopeful something will show back up before the holidays.", 1, "t1_g9fs0nn"], "g9g0fb1": ["Hmm well mine didn't last that long :(", 1, "t1_g9fvrjp"], "g9ft64b": ["i3 is basically an i7 without the individual room mappings.  So with an i7 you can tell the bot to clean the kitchen and it'll go straight to the kitchen and when done return to base.  Everything else is pretty much on par with the i7.\n\nThe fact that they released this so close to the holidays isn't a coincidence; they're hoping to lure people who wanted and i7 but couldn't afford it.  I don't know if there will be any super deals, but I expect there will be some discounting going on so keep your eyes open.  \n\nFull disclosure: I reviewed the i3 for Best Buy so I got it free but my opinions are my own.", 1, "t1_g9fsc9q"]}], "jghsly": ["Shelly vs Sonoff\nHello to everyone,\n\ni live in Europe and now I'm building my house and i just can't find out the best, safest automation i can get to setup my lights, roller shutters, garage door, stair lights with motion sensor..\n\nI'm between shelly and sonoff products but the I'm not sure...\n\nAny advice?  Safety is a priority of course.\n\nSonoff has more to offer at cheaper prices with zigbee hub and sensor but shelly has fewer products but i think are more versatile with higher quality and are made in Europe.. \n\nAny opinion is welcome!!!", "https://www.reddit.com/r/homeautomation/comments/jghsly/shelly_vs_sonoff/", 1, 9, "homeautomation", "trust", {"g9ter6r": ["Very frustrating decision.. Shelly has so many good reviews but I've noticed that their app on play store has too much negative reviews and also they haven't updated it since March!!! How is that possible???", 1, "t1_g9t7epm"], "g9sgyit": ["Shelly all the way for safety, sonoff for the price,\nI have done the whole electrics for a house in the UK with Shelly and we wired it all up as you would a normal house, and then the Shelly dimmers fit nice a snug in the back of the wall plates and it makes it all \"smart\" they are a great piece of kit!\n\nI got a few of the sonoff switches as they were so much cheaper but the build quality was horrible, the connections for the cables seemed weak and I would never trust putting it inside a wall..", 1, "t3_jghsly"], "g9unn7n": ["Forgot to mention, when I reached out to their support on one specific dimming related issue, they took unacceptably long to respond, were a little rude, and ultimately ghosted when they could not propose a solution.", 1, "t1_g9ter6r"], "g9t7epm": ["Inability to connect to the device at all or general slowness in doing so. The app is also notably ugly looking.", 1, "t1_g9swpml"], "g9qtxkk": ["Personally I wouldn't build my whole home automation around them.\nI think get yourself a ZigBee/zwave hub or a raspberry pi with the dongles etc \nAnd then you can mix in the sonoffs and Shelley's.\nI've had plenty of sonoffs in the past with no trouble from any of them but not had any Shelly but I know loads who have and they all say the build quality is better and they have better certification then the sonoffs and you can also do MQTT with the shelly but I don't think you can with the Sonoffs even with tasmota, but I'm not sure on that one as it's been a while since I looked.", 1, "t3_jghsly"], "g9ujj9l": ["For me, Shelly wins for the UL certification here in the US.  If something goes south and the house burns down, I don't need the insurance company denying my claims because I had a  device installed that was not UL certified. \n\nOnce flashed with tasmota, they're rock solid on my network. \n\nMy network is rather busy now so I'm starting to mix in zigbee products as well.", 1, "t3_jghsly"], "g9smn52": ["I added a few Shelly products to my home and integrate them with Homekit via Homebridge alongside a wide range of other crap. The Shelly products are by far the worst in terms of reliability for following commands in the system, and the Shelly app itself is by far the worst smart-home-device app of all the ones I've encountered from various manufacturers. I realize Shelly gets lots of love all over the internet, and from a pure feature-list perspective, it is easy to see why. Regardless, I'm now willing to spend more moving forward to get a better experience because the Shelly devices are just that flaky for me.\n\nNo, it's not a wifi thing--I have stellar wifi and network management--mostly commercial grade stuff that is rock solid. That said, wifi sucks for smart home automation anyway; I'd always lean toward ZigBee/z-wave moving forward. And for the love of \\[insert preferred deity or lack thereof\\] don't do Bluetooth.\n\nIn terms of reliability, it's a little spendy, but Lutron cannot be beaten. Hue is great if you have deep pockets, but I like that Lutron lives and operates from the light switch location and will operate as a normal thing even if the entire concept of the internet were suddenly snuffed out of existence (mother-in-law proof). \n\n* Shelly 1\n* Shelly Dimmer x2\n* A standalone bulb\n\nIn terms of reliability, it's a little spendy, but Lutron cannot be beaten. Hue is also solid if you have deep pockets, but I like that Lutron lives and operates from the light switch location and will operate as a normal thing even if the entire concept of the internet were suddenly snuffed out of existence (mother-in-law proof). You also never have to worry about RF interference.", 1, "t3_jghsly"], "g9swpml": ["Is it really so bad in software perspective? What common problems did you had?\nThanks", 1, "t1_g9smn52"], "g9rm15o": ["You might check out this video from \"The Hook Up\" YouTube channel:\n\n[https://youtu.be/J20hxfUTP9I](https://youtu.be/J20hxfUTP9I)", 1, "t3_jghsly"]}], "jfcenw": ["RGBCT Bulbs are a mess! What do you use?\nRGBCT Bulbs are a mess!\n\nIn the Zigbee world, I have found these options.\n\n* IKEA Tradfri\n   * untested by me\n* Philips Hue\n   * great, but pricey\n   * working through the Hue Hub is less good, since there is a delay on state updates due to polling\n* Sylvania/Osram/LEDVance\n   * so many different models sold under so many different names and they all seem to work a little bit differently\n   * The models I've tried have odd quirks. For instance, I have \"Sylvania 73693\" and Sylvania \"73739\" that, when turning on with a different color than the last time it was on, first flash to the old color and brightness, then adjust to the new color and brightness.\n* Sengled\n   * untested by me but the white bulbs work great\n\nIn the WiFi world, we have these options:\n\n* LIFX\n   * pricey\n   * untested by me\n* YeeLight\n   * reverse engineered protocol, so I am hesitant to trust we won't be blocked in the future\n   * untested by me\n* Hue Wiz\n   * untested by me\n   * no official Home Assistant support\n* Tuya (under so many different brand names)\n   * slow cloud protocol with native firmware\n   * tuya-convert doesn't work on new devices\n   * tasmota hacked bulbs don't support transitions\n   * local tuya reverse engineering isn't stable\n* TP-Link\n   * untested by me, but their outlets work great\n\nWhich RGB **and** White bulbs are you using that you've had a good experience with that also meet the following criteria?\n\n* No Tuya devices (because it's too hard to tell if I'll get a hackable bulb or not, and they are too slow on native firmware over the cloud).\n* Keep prices under $30/bulb US.\n* At least 800lm.\n* E26/A19 bulbs (i.e. fit standard US lamp sockets and fixtures)\n* Have mostly stable support in Home Assistant (custom\\_components are okay)", "https://www.reddit.com/r/homeautomation/comments/jfcenw/rgbct_bulbs_are_a_mess_what_do_you_use/", 1, 74, "homeautomation", "trust", {"g9jr70h": ["Agreed, the Red series is quite amazing. When they were out of stock, I purchased some of the newer Zooz switches, and they are also quite good.", 1, "t1_g9jqvcw"], "g9jr1hk": ["I have the TP-Link light bulbs and they work great, but I have heard so many people having issues with the so I might be a lucky one.", 1, "t3_jfcenw"], "g9jsnb9": ["I bought one as an experiment, and I'm generally underwhelmed by the bulb. It's my least favorite, and I just swapped it out last night for a Hue. In particular, I've seen it get hung up and non-responsive multiple times when changing between RGB and CT, and it doesn't seem to like being sent hue, saturation, and level all at once when in RGB mode. That's running the latest beta firmware and the latest available driver for Hubitat.\n\nI would also say the Hue is brighter and has a wider color gamut.\n\nI say this as someone with over 20 LZW switches and a general love for the company. Both the multisensor and the bulb were existing white label products I believe.", 1, "t1_g9jq5y1"], "g9jty24": ["&gt; For instance, my daughter has a 5 bulb fixture in her room that I automate to different colors depending on the holiday we're near.\n\nPut her back on plain white bulbs for that fixture and get a WS2812b addressable light strip for $15 to do all your cool holiday animations.   \n\nTo be honest, I don't understand why people even buy smart bulbs. I buy regular bulbs and automate all my switches. A decent ZigBee switch is less than what you are paying for your bulbs and don't have a limited life span. If I want to add color accents, I do it with LED's.", 1, "t1_g9jnxcm"], "g9jxptn": ["I love my Inovelli Ilumin Z-Wave bulbs.. they were like $17/ea if you buy them unboxed", 1, "t3_jfcenw"], "g9jw640": ["FWIW I have an older house and a lot of rooms are on lamps, not switched fixtures. For me Bulbs are a solid choice.", 1, "t1_g9jty24"], "g9k3ekw": ["I just ordered a 3 pack of hue white and color bulbs for $90. Haven't gotten a chance to play with them yet, but the dimable white bulbs work well so far.", 1, "t3_jfcenw"], "g9k36xe": ["I have tried Ikea, two older Sylvania/Osrams, and LiFX.\n\nThe two Sylvania/Osram bulbs suffered from poor color rendition (this was especially noticeable with orange).  One died early on, the other lasted about a year.  They ran incredibly hot and the plastic housing cracked on both.  IIRC, these were Sylvania-branded Lightify bulbs that I had purchased on clearance when they were changing the branding on their Lightify stuff.  Since I have had poor luck with Sylvania/Osram products in general I don't think I'll be buying any more of their stuff in the future.\n\nThe Ikea isn't horrible but color rendition could be much better. \n Cyan looks more like a cool white, which I don't understand because Blue and Green look fine.  I only have the one bulb so I have no idea if my bulb is defective or if this is a common problem with the Ikea bulbs.  I like that I can bind it to the Ikea remote in zigbee2mqtt without having to use the Ikea hub (Once I figured it out, that is.  I found the documentation very limited with regard to binding and had to do a lot of digging before I finally understood that many Ikea devices need to be part of a Zigbee group and the remote needs to be bound to the group, not the device.)\n\nIMO, LiFX is the best of the three.  I have had an A19 for almost a year now and it has been problem free.  All of the colors are accurate and look great.  The only issue I have with LiFX is the price, they're expensive unless you can catch them on sale.  I bought mine during a holiday sale last year so maybe watch for that (if you can find any for sale, that is.  LiFX seems to be having some awful supply and logistics issues at the moment.)", 1, "t3_jfcenw"], "g9kb3ak": ["I'll second Sengled bulbs.   The price is hard to beat, and the performance has been excellent.   I've had the white bulbs the longest, and all 10 that I use have outlasted several GE 'dumb' bulbs I replaced at the same time.   \n\nColored bulbs are all newer, but the color reproduction is good.    Red is red, green is green, blue is blue.    The one color that is tough to get is a deep purple.  Purples seem washed out, and less vibrant than blue or red.  \n\nI'm pairing all of my lights through a smart-things hub, and control with both home assistant and google home.", 1, "t1_g9jtm49"], "g9kfmmy": ["I wish they'd do it as an option like Hue.  It's been a feature request for several years now.", 1, "t1_g9kbhbj"], "g9kft3w": ["I use outlet dimmers and smart switches whenever possible. In rooms where I want multiple color temperatures or for fixtures where color bulbs are desired, smart bulbs are really the only option.", 1, "t1_g9k905b"], "g9keanj": ["I agree with you but there are many folks including myself who rents. I'm not allowed to mess with anything that's behind the wall. So swapping out the switches is no go for me. Until I own my own home, I can only stick to smart bulbs for now.", 1, "t1_g9jty24"], "g9l7qit": ["&gt; if you can find any for sale, that is.  LiFX seems to be having some awful supply and logistics issues at the moment.\n\nOn the one hand, their 1100W and 800W color bulbs are pretty much nowhere to be found (I scored two from Best Buy a couple weeks ago purely by luck; they were showing sold out and I happened to refresh and they were in stock so I bought without even thinking).  On the other hand, they're just straight giving away their warm white mini bulb (I got two \"free\" on Prime Day with Echo purchases, for example).  I haven't even taken those out of their boxes and probably never will, as I don't have much use for a \"smart\" bulb that can only dim.", 1, "t1_g9k36xe"], "g9l7dzf": ["Just being pedantic -- your HUSBZB-1 *is* the hub.", 1, "t1_g9jsw7n"], "g9l47am": ["My tradfri 800lm e27 bulb is rgb cct according to ikea. However, when i link it to philips hue or smartthings, they think it is a rgb bulb. When you set them to white-like colors, its obvious that the bulb does use the white leds (they are brighter). The only issue is then that philips/smartthings don't show a slider for cold/warm white. This means it is quite fiddly on the color wheel to get a nice warm/cool white.\n\nEdit: this thread is about e26 bulbs, i know, but they're probably similar.", 1, "t3_jfcenw"], "g9monw5": ["Osram didn’t just rebrand it - they [sold it](https://en.wikipedia.org/wiki/LEDVANCE#History) and it’s now a separate company.", 1, "t1_g9k4qoo"], "g9lc20z": ["I couldn't ever imagine wanting to spend money on home automation in a rental, because every last extra dollar I had I was putting away for the down-payment on my house.\n\nAnyone deciding that they're going to spend a few hundred, or even $1000 on home automation for their rental are ridiculous imo, that is $1000 that could have been put towards a down-payment.", 1, "t1_g9kyret"], "g9ld3v3": ["Buying is not the right answer for many people, even if they could easily afford to. I see nothing wrong with renters spending money on automation. None of it is wasted since they can just take it with them to their next place.", 1, "t1_g9lc20z"], "g9lfels": ["so you use something like this?   https://www.amazon.com/Smart-Wifi-Bulb-Socket-Pack/dp/B07B9RP667\n\ni had thought of doing that myself....still deciding.", 1, "t1_g9jty24"], "g9lojuw": ["I love my Tradfri bulbs with a custom zigbee2mqtt bridge! They've been very reliable and I haven't needed to use the IKEA hub since zigbee2mqtt added OTA firmware updating. Negative point is same as Lifx: if there is a power loss they will turn on when power is restored.", 1, "t3_jfcenw"], "g9jmyvl": ["Ikea and Philips are all I use.  Sylvania/Osram/LEDVance  were unreliable, especially the ones that couldn't be added directly to the Hue bridge and had to be added to the Smartthings briddge. \n\nPhilips may cost more but i have had them since day 1 and they are extremely reliable", 1, "t3_jfcenw"], "g9k214a": ["I use hue. So many hue bulbs. So expensive, but they all just work.", 1, "t3_jfcenw"], "g9jojyw": ["I've used these MiLight Bulbs too (RGBCT version), with the same esp8266 virtual gateway you're using.\n\nThey worked great for a bit. Then I started having issues with missed commands. It got to the point where, even with the hub within 5 feet of the bulbs, they still wouldn't get the commands I sent over 50% of the time. I'm not sure if it's because I was sending commands to multiple lights at once, or because some component in the light or the gateway degraded. But, it got annoying enough that I pulled them all out.", 1, "t1_g9jo03v"], "g9jq5y1": ["They are out of stock at the moment. But, the Inovelli products I have used have been wonderful and well priced. I'll keep an eye out for when these are available again and give them a test run. Thank you!", 1, "t1_g9jpvdd"], "g9k905b": ["I much prefer an outlet dimmer over a smart bulb for my few lamps.", 1, "t1_g9jw640"]}], "jfnfkj": ["Smart IoT button?\nIs anyone familiar with a simple programmable IoT button that is wireless?\n\nWanting to keep track of when dogs and cats are fed/snacked/medicated and would like a couple of these to make the process simpler.", "https://www.reddit.com/r/homeautomation/comments/jfnfkj/smart_iot_button/", 1, 14, "homeautomation", "trust", {"g9lxjlm": ["idk if u have a cat, but just because you grab a pill doesn't mean they take it. lol. my dogs are much easier, though.\n\nThank you for your suggestion, though! that's a good point. I won't be opening the dog food unless I'm feeding them/refilling the container.", 1, "t1_g9lupdy"], "g9lmdk9": ["I'm currently exploring Zigbee sensors with Zigbee Home Automation. There's a few cheap ones from Ikea, Itead and Aqara. Zigbee is better than Wifi on batteries. I only started my testing with the Sonoff bridge (tasmota flashed) and the Aqara vibration sensors and still waiting for other Zigbee devices\n\nHere's a list Zigbee operated buttons\nhttps://zigbee.blakadder.com/remotes.html", 1, "t3_jfnfkj"], "g9lupdy": ["I mean, I didn't say automatic pill giver. I literally said something that automatically registeres when you access the medication.", 1, "t1_g9luhtz"], "g9lcv49": ["That's unfortunately a flawed design as it requires someone to press the button. Think more like an automatic feeder, or put the food/treats/meds in a container with a door open sensor. I also recommend always designating only one person to medicate children and pets.", 1, "t3_jfnfkj"], "g9nijck": ["I'm not sure if this will help, but I thought I'd suggest it because I'm exploring something kind of similar. Check out the [Aqara Cube](https://www.amazon.com/gp/product/B07S9G5MR6/ref=ox_sc_saved_title_1?smid=A35PXP61BJ01A2&amp;psc=1) if you haven't already seen it.", 1, "t3_jfnfkj"], "g9lumia": ["Ooh this is promising! Thank you!", 1, "t1_g9lgi45"], "g9luhtz": ["Sort of fair point, but I don't trust technology to accurately feed/medicate my dogs. Also I can't afford a robot to hold my dog and force a pill down their throat.", 1, "t1_g9lcv49"], "g9luqbf": ["Ooh, that works! My father has tons of these. I'll check this out. Thank you!", 1, "t1_g9llhmy"], "g9m6ok6": ["I second this. I have a couple of these - they work great.", 1, "t1_g9lumia"], "g9lgi45": ["Shelly Button1.", 1, "t3_jfnfkj"], "g9llhmy": ["The ESP8266 can send a message somewhere when high and low signals are received on the pins.  The complexity of the project really depends on what you mean by 'keep track.'", 1, "t3_jfnfkj"], "g9lujxl": ["Thank you! I will check this out.", 1, "t1_g9lmdk9"], "g9mdz0r": ["Can they by any chance be configured to trigger IFTT?", 1, "t1_g9ma1iq"], "g9ma1iq": ["Smartthings buttons are working great for me.", 1, "t3_jfnfkj"]}], "jfz1d8": ["Smart Power Bars\nI have a couple of Geeni (Merkury Innovations) products from Walmart and Canadian Tire.  To say that I don't trust them is an understatement.\n\nTheir RGB bulbs are dim, but work and I have a dead exterior plug, which they have been \"waiting\" a year to get a replacement under \"warranty\" (it's never going to come).\n\nWhat I actively want to replace is the Geeni WiFi power bar.  I have it attached to my aquarium lights, pump, air pump and heater.  I discover that it is randomly shutting plugs off all the time.\n\nIs there a reliable and reasonably priced ZigBee, Z-Wave or WiFi  power bar out there?", "https://www.reddit.com/r/homeautomation/comments/jfz1d8/smart_power_bars/", 1, 1, "homeautomation", "trust", {"g9na52e": ["I've been using this and am quite happy with it in terms of reliability: https://smile.amazon.com/gp/product/B083JKSSR5/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&amp;psc=1", 1, "t3_jfz1d8"]}]}]